
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>你可能不需要ReCAPTCHA · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="../how-to-convince-your-team-to-adopt-grid/ch.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    杂物空间·翻译
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../how-to-convince-your-team-to-adopt-grid/ch.html">
            
                <a href="../how-to-convince-your-team-to-adopt-grid/ch.html">
            
                    
                    如何说服你的团队采用CSS Grid
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter active" data-level="2.1" data-path="ch.html">
            
                <a href="ch.html">
            
                    
                    你可能不需要ReCAPTCHA
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >你可能不需要ReCAPTCHA</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x4F60;&#x53EF;&#x80FD;&#x4E0D;&#x9700;&#x8981;recaptcha"><a href="https://www.yuque.com/ysfe/ykx/recaptcha" target="_blank">&#x4F60;&#x53EF;&#x80FD;&#x4E0D;&#x9700;&#x8981;ReCAPTCHA</a></h2>
<p><b><a href="https://twitter.com/Nearcyan" target="_blank">Kevin Davis</a>@2019-06-11  <a href="https://kevv.net/you-probably-dont-need-recaptcha/" target="_blank">&#x539F;&#x6587;&#x94FE;&#x63A5;</a></b> </p>
<blockquote>
<p><em>&#x7FFB;&#x8BD1;&amp;&#x6821;&#x9A8C;&#xFF1A;<a href="https://github.com/yylifen" target="_blank">freedom</a></em> </p>
</blockquote>
<p>&#x5F53;&#x9762;&#x5BF9;&#x963B;&#x6B62;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x548C;&#x81EA;&#x52A8;&#x7684;&#x6076;&#x610F;&#x901A;&#x4FE1;&#x635F;&#x5BB3;&#x5176;&#x670D;&#x52A1;&#x7684;&#x9700;&#x6C42;&#x65F6;&#xFF0C;Google&#x7684;<a href="https://en.wikipedia.org/wiki/ReCAPTCHA" target="_blank">reCAPTCHA</a>&#x5E38;&#x5E38;&#x662F;&#x8BB8;&#x591A;&#x7F51;&#x7AD9;&#x7BA1;&#x7406;&#x5458;&#x4F7F;&#x7528;&#x7684;&#x9996;&#x9009;&#x5DE5;&#x5177;&#x3002;&#x5728;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x901A;&#x8FC7;&#x51E0;&#x4E2A;&#x539F;&#x56E0;&#x89E3;&#x91CA;&#x4E86;&#x4E3A;&#x4EC0;&#x4E48;reCAPTCHA&#x901A;&#x5E38;&#x4E0D;&#x662F;&#x7528;&#x4E8E;&#x8FD9;&#x4E2A;&#x76EE;&#x7684;&#x6700;&#x4F73;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x901A;&#x5E38;&#x662F;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x8FD8;&#x4F1A;&#x7ED9;&#x7528;&#x6237;&#x5E26;&#x6765;&#x4E00;&#x4E9B;&#x4E0D;&#x4FBF;&#xFF0C;&#x5E76;&#x4E14;&#x8BA9;&#x7528;&#x6237;&#x65E0;&#x6CD5;&#x9009;&#x62E9;&#x8DF3;&#x8FC7;&#x4ED6;&#x4EEC;&#x7684;&#x5BC6;&#x96C6;&#x8DDF;&#x8E2A;&#x548C;&#x6307;&#x7EB9;&#x8BC6;&#x522B;&#x3002;&#x9488;&#x5BF9;ReCAPTCHA&#x7684;&#x5404;&#x79CD;&#x5A01;&#x80C1;&#x6A21;&#x578B;&#x6211;&#x63D0;&#x51FA;&#x4E86;&#x51E0;&#x79CD;&#x66FF;&#x4EE3;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x822C;&#x4F7F;&#x7528;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x6700;&#x4F73;&#x505A;&#x6CD5;&#x3002;</p>
<blockquote>
<p><a href="https://zh.wikipedia.org/wiki/ReCAPTCHA" target="_blank">ReCAPTCHA&#x5728;&#x7EF4;&#x57FA;&#x767E;&#x79D1;&#x7684;&#x4E2D;&#x6587;&#x94FE;&#x63A5;</a></p>
</blockquote>
<p><img src="https://yylifen.github.io/sundries-trans/other/you-probably-dont-need-recaptcha/images/recaptcha.png" alt=""></p>
<h3 id="recaptcha&#x662F;&#x6709;&#x5BB3;&#x7684;">reCAPTCHA&#x662F;&#x6709;&#x5BB3;&#x7684;</h3>
<p>reCAPTCHA&#x662F;&#x8C37;&#x6B4C;&#x4E3A;&#x4EFB;&#x4F55;&#x7F51;&#x7AD9;&#x7BA1;&#x7406;&#x5458;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x670D;&#x52A1;&#x8303;&#x56F4;&#x5185;&#x63D0;&#x4F9B;&#x7684;&#x53C8;&#x4E00;&#x514D;&#x8D39;&#x4EA7;&#x54C1;&#x3002;reCAPTCHA&#x662F;&#x5982;&#x4F55;&#x5408;&#x6CD5;&#x5730;&#x533A;&#x5206;&#x4EBA;&#x7C7B;&#x7528;&#x6237;&#x548C;&#x673A;&#x5668;&#x4EBA;&#x5462;&#xFF1F;reCAPTCHA&#x5E7F;&#x6CDB;&#x4F9D;&#x8D56;&#x4E8E;&#x7528;&#x6237;&#x6307;&#x7EB9;&#xFF0C;&#x5F3A;&#x8C03;&#x201C;&#x8FD9;&#x4E2A;&#x7528;&#x6237;&#x662F;&#x8C01;&#xFF1F;&#x201D;&#x800C;&#x4E0D;&#x662F;&#x666E;&#x901A;&#x7684;&#x201C;&#x8FD9;&#x4E2A;&#x7528;&#x6237;&#x662F;&#x4EBA;&#x7C7B;&#x5417;&#xFF1F;&#x201D;&#x3002;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x767B;&#x5F55;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;Google&#x5E10;&#x6237;&#x65F6;&#xFF0C;&#x6210;&#x529F;&#x5730;&#x89E3;&#x51B3;reCAPTCHA&#x591A;&#x4E48;&#x5BB9;&#x6613;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5141;&#x8BB8;&#x4E86;Google&#x5C06;&#x4ED6;&#x4EEC;&#x7684;&#x884C;&#x4E3A;&#x4E0E;&#x4ED6;&#x4EEC;&#x7684;&#x771F;&#x5B9E;&#x8EAB;&#x4EFD;&#x8054;&#x7CFB;&#x8D77;&#x6765;&#x3002;&#x5BF9;&#x4E8E;&#x975E;&#x8C37;&#x6B4C;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x7528;&#x6237;&#x6765;&#x8BF4;&#xFF0C;&#x4E5F;<a href="https://news.ycombinator.com/item?id=20147015" target="_blank">&#x7ECF;&#x5E38;&#x4F1A;&#x51FA;&#x73B0;</a><a href="https://news.ycombinator.com/item?id=20147015" target="_blank">&#x7C7B;&#x4F3C;&#x7684;&#x6548;&#x679C;</a>&#xFF0C;&#x4ED6;&#x4EEC;&#x6CE8;&#x610F;&#x5230;&#x5728;Firefox&#x6D4F;&#x89C8;&#x5668;&#x4E0A;&#x5B8C;&#x6210;reCAPTCHA&#x9700;&#x8981;&#x82B1;&#x8D39;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x8FD9;&#x4E0E;&#x8C37;&#x6B4C;&#x591A;&#x5E74;&#x6765;&#x4E3A;&#x63D0;&#x9AD8;&#x5E02;&#x573A;&#x4EFD;&#x989D;&#x800C;&#x4F7F;&#x7528;&#x7684;<a href="https://wccftech.com/former-mozilla-vp-says-google-intentionally-damaged-firefox/" target="_blank">&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x53CD;&#x7ADE;&#x4E89;&#x6280;&#x672F;</a>&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x7CBE;&#x51C6;&#x786E;&#x5B9A;ReCAPTCHA&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x662F;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#x7684;&#xFF0C;&#x8C37;&#x6B4C;&#x4E0D;&#x4EC5;&#x4E25;&#x91CD;&#x6DF7;&#x6DC6;&#x4E86;&#x8FD9;&#x90E8;&#x5206;JavaScript&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x4F7F;&#x7528;&#x5176;&#x81EA;&#x8EAB;&#x7684;&#x5B57;&#x8282;&#x4EE3;&#x7801;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x4E86;&#x6574;&#x4E2A;&#x865A;&#x62DF;DOM&#xFF0C;&#x4F46;&#x4ECD;&#x6709;&#x8BB8;&#x591A;&#x5C1D;&#x8BD5;&#x53CD;&#x5411;&#x5DE5;&#x7A0B;&#x4E00;&#x4E9B;&#x5BA2;&#x6237;&#x7AEF;&#x4EE3;&#x7801;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x903B;&#x8F91;&#x5982;&#x4F55;&#x64CD;&#x4F5C;&#x8FDB;&#x884C;&#x7406;&#x8BBA;&#x3002;&#x9006;&#x5411;&#x5DE5;&#x7A0B;ReCAPTCHA&#x7684;<a href="https://github.com/toogle/InsideReCaptcha" target="_blank">&#x521D;&#x6B65;&#x5C1D;&#x8BD5;</a>&#x663E;&#x793A;&#x4E86;&#x5927;&#x91CF;&#x5DF2;&#x6536;&#x96C6;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5305;&#x62EC;&#x4F46;&#x4E0D;&#x9650;&#x4E8E;&#xFF1A;&#x63D2;&#x4EF6;&#x3001;&#x7528;&#x6237;&#x4EE3;&#x7406;&#x3001;IP&#x5730;&#x5740;&#x3001;&#x5C4F;&#x5E55;&#x5206;&#x8FA8;&#x7387;&#x3001;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x3001;&#x65F6;&#x533A;&#x3001;&#x8BED;&#x8A00;&#x3001;&#x5355;&#x51FB;/&#x952E;&#x76D8;/&#x89E6;&#x6478;&#x4FE1;&#x606F;&#x3001;&#x8BB8;&#x591A;&#x6D4F;&#x89C8;&#x5668;&#x7279;&#x5B9A;&#x529F;&#x80FD;&#x548C;CSS&#x8BC4;&#x4F30;&#x7684;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x3001;&#x6709;&#x5173;&#x753B;&#x5E03;&#x5143;&#x7D20;&#x5448;&#x73B0;&#x7684;&#x4FE1;&#x606F;&#x4EE5;&#x53CA;cookie&#xFF0C;&#x5305;&#x62EC;&#x5728;&#x8FC7;&#x53BB;6&#x4E2A;&#x6708;&#x5185;&#x653E;&#x7F6E;&#x5728;Google&#x5E10;&#x6237;&#x7684;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x7406;&#x7531;&#x53EF;&#x4EE5;&#x89E3;&#x91CA;&#x4E3A;&#x4EC0;&#x4E48;reCAPTCHA&#x4F7F;&#x7528;google.com&#x7684;&#x57DF;&#x540D;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x4E8E;reCAPTcha&#x7684;&#x57DF;&#x540D;&#x3002;&#x8FD9;&#x5141;&#x8BB8;Google&#x63A5;&#x6536;&#x4ED6;&#x4EEC;&#x5DF2;&#x7ECF;&#x4E3A;&#x4F60;&#x8BBE;&#x7F6E;&#x7684;&#x4EFB;&#x4F55;cookie&#xFF0C;&#x6709;&#x6548;&#x5730;&#x7ED5;&#x8FC7;&#x4E86;&#x8BBE;&#x7F6E;&#x7B2C;&#x4E09;&#x65B9;cookie&#x7684;&#x9650;&#x5236;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x4E0E;&#x5927;&#x591A;&#x6570;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x7684;Google&#x6240;&#x6709;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x8FDB;&#x884C;&#x6D41;&#x91CF;&#x5173;&#x8054;&#x3002;reCAPTCHA&#x6536;&#x96C6;&#x4E86;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x53EF;&#x4EE5;&#x53EF;&#x9760;&#x5730;&#x89E3;&#x9664;&#x8BB8;&#x591A;&#x7528;&#x6237;&#x7684;&#x533F;&#x540D;&#x6027;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E9B;&#x7528;&#x6237;&#x53EA;&#x662F;&#x60F3;&#x8BC1;&#x660E;&#x4ED6;&#x4EEC;&#x4E0D;&#x662F;&#x673A;&#x5668;&#x4EBA;&#x3002;&#x7531;&#x4E8E;JavaScript&#x751A;&#x81F3;&#x9700;&#x8981;&#x9A6C;&#x4E0A;&#x67E5;&#x770B;reCAPTCHA&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x8FD0;&#x884C;&#x8BF8;&#x5982;TBB(Tor Browser Bundle)&#x8FD9;&#x6837;&#x7684;&#x8F6F;&#x4EF6;&#x7684;&#x7528;&#x6237;&#x4E5F;&#x53EF;&#x80FD;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x6CC4;&#x9732;&#x7684;&#x4FE1;&#x606F;&#x6BD4;&#x4ED6;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x8981;&#x591A;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x8C03;&#x6574;&#x4E86;&#x6D4F;&#x89C8;&#x5668;&#x7A97;&#x53E3;&#x7684;&#x5927;&#x5C0F;(&#x4E0D;&#x9F13;&#x52B1;&#x4F7F;&#x7528;reCAPTCHA&#x6B63;&#x662F;&#x51FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;)&#x3002;</p>
<p>&#x76F8;&#x5E94;&#x5730;&#xFF0C;&#x7F51;&#x7AD9;&#x7BA1;&#x7406;&#x5458;&#x8981;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x7F51;&#x7AD9;&#x4E0A;&#x4F7F;&#x7528;Google&#x7684;ReCAPTCHA&#x5C31;&#x5FC5;&#x987B;&#x94FE;&#x63A5;&#x5230;Google&#x7684;&#x9690;&#x79C1;&#x548C;&#x672F;&#x8BED;&#x9875;&#x9762;&#xFF08;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4EE5;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;8px&#x6837;&#x5F0F;&#x5305;&#x542B;&#x5728;&#x8868;&#x5355;&#x4E2D;&#xFF0C;&#x4F7F;&#x5B83;&#x4EEC;&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x53EF;&#x7528;&#xFF09;&#x3002;&#x867D;&#x7136;&#x8C37;&#x6B4C;&#x8FC7;&#x53BB;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x9690;&#x79C1;&#x548C;&#x7528;&#x4E8E;&#x91CD;&#x65B0;&#x6355;&#x83B7;&#x7684;&#x672F;&#x8BED;&#x9875;&#x9762;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x94FE;&#x63A5;&#x4E0D;&#x518D;&#x662F;&#x9488;&#x5BF9;ReCAPTCHA&#x7684;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x662F;Google&#x670D;&#x52A1;&#x7684;&#x6240;&#x6709;&#x7528;&#x6237;&#x7684;<a href="https://policies.google.com/privacy?hl=en" target="_blank">&#x9690;&#x79C1;</a>&#x548C;<a href="https://policies.google.com/terms?hl=en" target="_blank">&#x672F;&#x8BED;</a>&#x9875;&#x9762;&#xFF0C;&#x800C;&#x4E0D;&#x7BA1;&#x4F7F;&#x7528;&#x54EA;&#x4E2A;&#x670D;&#x52A1;&#xFF0C;&#x6216;&#x8005;&#x5982;&#x679C;&#x7528;&#x6237;&#xFF08;&#x6216;&#x751A;&#x81F3;&#x5E0C;&#x671B;&#xFF09;Google&#x5E10;&#x6237;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x63A5;&#x53D7;&#x8FD9;&#x4E9B;&#x672F;&#x8BED;&#xFF08;&#x9690;&#x542B;&#x5730;&#xFF0C;&#x901A;&#x8FC7;&#x5C1D;&#x8BD5;&#x8BC1;&#x660E;&#x4F60;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x4EBA;&#xFF09;&#x4F1A;&#x6388;&#x4E88;&#x8C37;&#x6B4C;&#x5141;&#x8BB8;&#x4ED6;&#x4EEC;&#x4E3A;&#x5176;&#x6B63;&#x5E38;&#x7528;&#x6237;&#x5BF9;&#x4F60;&#x7684;&#x670D;&#x52A1;&#x6240;&#x505A;&#x7684;<strong>&#x4E00;&#x5207;</strong>&#xFF0C;&#x5F88;&#x5C11;&#x6709;&#x5173;&#x4E8E;&#x5177;&#x4F53;&#x5B8C;&#x6210;&#x7684;&#x4FE1;&#x606F;&#xFF08;GDPR&#x53EF;&#x80FD;&#x5728;&#x6B64;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x4F5C;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;ReCAPTCHA&#x662F;&#x4E3A;&#x4E86;&#x8FBE;&#x5230;&#x963B;&#x6B62;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x76EE;&#x7684;&#xFF09;&#x3002;&#x4E0D;&#x4EC5;&#x5728;ReCAPTCHA&#x6846;&#x4E2D;&#x7684;&#x65E0;&#x7528;&#x94FE;&#x63A5;&#x4ECE;&#x672A;&#x88AB;&#x7528;&#x6237;&#x6253;&#x5F00;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;Google&#x5FBD;&#x6807;&#x6216;&#x89C6;&#x89C9;&#x53C2;&#x8003;&#x6765;&#x6307;&#x793A;ReCAPTCHA&#x662F;Google&#x670D;&#x52A1;&#xFF0C;&#x56E0;&#x6B64;&#x8BB8;&#x591A;&#x7528;&#x6237;&#x6709;&#x96F6;&#x8868;&#x793A;&#x4ED6;&#x4EEC;&#x521A;&#x521A;&#x540C;&#x610F;&#x6240;&#x6709;Google&#x7684;&#x8DDF;&#x8E2A;&#xFF0C;&#x53EA;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x8BD5;&#x56FE;&#x5728;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#x4E0A;&#x7559;&#x4E0B;&#x53CD;&#x9988;&#x6216;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;ticket&#x3002;&#x5982;&#x679C;&#x4F60;&#x8BA4;&#x4E3A;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x4F7F;&#x7528;Google&#x670D;&#x52A1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x7528;Internet&#xFF0C;&#x8BF7;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;Internet&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x586B;&#x5199;&#x5355;&#x4E2A;ReCAPTCHA&#xFF0C;&#x56E0;&#x4E3A;&#x67D0;&#x4E9B;&#x7528;&#x6237;&#x9700;&#x8981;&#x652F;&#x4ED8;&#x8D26;&#x5355;&#x3001;&#x63D0;&#x4EA4;&#x5176;&#x7A0E;&#x8D39;&#xFF0C;&#x6709;&#x65F6;&#x751A;&#x81F3;&#x4F7F;&#x7528;&#x653F;&#x5E9C;&#x7F51;&#x7AD9;&#xFF08;&#x5982;&#x679C;&#x4F60;&#x4EE5;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x7BA1;&#x7406;&#x6B64;&#x670D;&#x52A1;&#xFF0C;&#x5219;&#x4E0B;&#x4E00;&#x6B21;&#x5C1D;&#x8BD5;&#x4E0D;&#x5411;Gmail/GSuite&#x5730;&#x5740;&#x53D1;&#x9001;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#xFF0C;&#x6216;&#x4F7F;&#x7528;GoogleAPI&#x8FDB;&#x884C;&#x66F4;&#x4EE4;&#x4EBA;&#x5174;&#x594B;&#x7684;&#x6311;&#x6218;&#xFF09;&#x3002;</p>
<p>&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x6B64;&#x7A0B;&#x5EA6;&#x4E0A;&#x5173;&#x5FC3;&#x7528;&#x6237;&#x9690;&#x79C1;&#x53EF;&#x80FD;&#x4E0D;&#x5728;&#x5927;&#x591A;&#x6570;&#x7F51;&#x7AD9;&#x7684;&#x5173;&#x6CE8;&#x8303;&#x56F4;&#x4E4B;&#x5916;&#x3002;&#x8BB8;&#x591A;&#x7F51;&#x7AD9;&#x5DF2;&#x7ECF;&#x4E0E;&#x8C37;&#x6B4C;&#x7684;&#x670D;&#x52A1;&#xFF08;&#x901A;&#x5E38;&#x5305;&#x62EC;Google&#x5206;&#x6790;&#x3001;Google&#x5E7F;&#x544A;&#x3001;GoogleAPI&#x3001;Google&#x6807;&#x7B7E;&#x7BA1;&#x7406;&#x5668;&#x3001;Google&#x9759;&#x6001;&#x8D44;&#x6E90;&#x3001;GoogleOAuth&#x3001;GoogleComputeEngine&#x7B49;&#xFF09;&#x7D27;&#x5BC6;&#x8026;&#x5408;&#xFF0C;&#x56E0;&#x6B64;&#x6DFB;&#x52A0;Googlecatcha&#x4F3C;&#x4E4E;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x4E0D;&#x8BA1;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x7F51;&#x7AD9;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x4EF7;&#x503C;&#x548C;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x6237;&#xFF0C;&#x8BB8;&#x591A;&#x4EBA;&#x4E0D;&#x60F3;&#x8981;&#x6C42;&#x7528;&#x6237;&#x540C;&#x610F;&#x8C37;&#x6B4C;&#x7684;&#x8DDF;&#x8E2A;&#x548C;&#x57FA;&#x672C;&#x4F7F;&#x7528;&#x3002;&#x9664;&#x4E86;&#x8C37;&#x6B4C;&#x4E4B;&#x5916;&#xFF0C;ReCAPTCHA&#x5F3A;&#x5236;&#x96C6;&#x6743;&#x5BF9;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x662F;&#x4E0D;&#x597D;&#x7684;&#x3002;</p>
<p>&#x9664;&#x4E86;reCAPTCHA&#x4F7F;&#x7528;&#x7684;&#x9690;&#x79C1;&#x542B;&#x4E49;&#x4E4B;&#x5916;&#xFF0C;&#x5BF9;&#x4E8E;&#x8BB8;&#x591A;&#x7C7B;&#x7528;&#x6237;&#x6765;&#x8BF4;&#xFF0C;&#x5B9E;&#x9645;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x975E;&#x5E38;&#x7E41;&#x7410;&#xFF0C;&#x6709;&#x65F6;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x7528;&#x6237;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x6839;&#x672C;&#x65E0;&#x6CD5;&#x5B8C;&#x6210;&#x9A8C;&#x8BC1;&#x7801;&#x9A8C;&#x8BC1;&#x3002;<a href="https://github.com/google/recaptcha/issues/286" target="_blank">&#x7528;&#x6237;&#x8BA8;&#x538C;reCAPTCHA</a>&#x3002;<a href="https://www.reddit.com/r/rant/comments/8yezeq/fuck_recaptcha/" target="_blank">&#x4ED6;&#x4EEC;</a><a href="https://devrant.com/rants/1754031/fuck-recaptcha-fuck-google-for-making-recaptcha-fuck-it-dont-be-evil-my-foot" target="_blank">&#x771F;&#x7684;</a><a href="https://www.neogaf.com/threads/the-select-all-images-with-a-street-sign-recaptcha-is-a-godless-creation-of-evil.1410504/" target="_blank">&#x5F88;&#x8BA8;&#x538C;</a><a href="https://news.ycombinator.com/item?id=19059390" target="_blank">reCAPTCHA</a>&#x3002;<a href="https://recaptcha.sucks/" target="_blank">reCAPTCHA</a><a href="https://strugee.net/blog/2019/04/make-recaptchas-im-not-a-robot-accurate" target="_blank">&#x662F;</a><a href="https://uxdesign.cc/recaptcha-is-uxs-worst-nightmare-c28b7341e88a" target="_blank">&#x5982;&#x6B64;</a><a href="https://www.reddit.com/r/unpopularopinion/comments/9haexn/googles_recaptcha_needs_to_be_fucking_made_illegal/" target="_blank">&#x4EE4;&#x4EBA;&#x8BA8;&#x538C;</a>&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;<a href="https://www.4chan.org/pass" target="_blank">&#x4E00;&#x4E9B;&#x7F51;&#x7AD9;</a>&#x7684;&#x76C8;&#x5229;&#x6A21;&#x5F0F;&#x662F;&#xFF0C;&#x6BCF;&#x5E74;&#x5411;&#x7528;&#x6237;&#x6536;&#x53D6;20&#x7F8E;&#x5143;&#x7684;&#x8D39;&#x7528;&#xFF0C;&#x4EE5;&#x7981;&#x7528;reCAPTCHA&#xFF0C;&#x800C;&#x8FD9;&#x662F;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x7684;&#x7528;&#x6237;&#x652F;&#x4ED8;&#x7684;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x542C;&#x8D77;&#x6765;&#x50CF;&#x4E00;&#x4E2A;&#x4F1F;&#x5927;&#x7684;&#x65B0;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;&#x5BF9;&#x4F60;&#x6765;&#x8BF4;&#xFF0C;&#x73B0;&#x5728;&#x4F60;&#x60F3;&#x6DFB;&#x52A0;reCAPTCHA&#x5230;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#x7684;&#x6BCF;&#x4E00;&#x9875;&#xFF0C;&#x4EE5;&#x4E89;&#x53D6;&#x6700;&#x5927;&#x7684;&#x5229;&#x6DA6;&#xFF0C;&#x6211;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#x3002;&#x6BCF;&#x6B21;&#x4F60;&#x60F3;&#x8981;&#x98DF;&#x7269;&#x6216;&#x6C34;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x90FD;&#x4F1A;&#x5F3A;&#x8FEB;&#x4F60;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;reCAPTCHA&#xFF0C;&#x76F4;&#x5230;&#x4F60;&#x5728;&#x7B2C;&#x4E00;&#x5468;&#x540E;&#x6B7B;&#x4E8E;&#x8425;&#x517B;&#x4E0D;&#x826F;&#x3002;&#x6211;&#x8BFB;&#x8FC7;&#x65E0;&#x6570;&#x7528;&#x6237;&#x7684;&#x5E16;&#x5B50;&#xFF0C;&#x4ED6;&#x4EEC;&#x5BF9;&#x4E00;&#x9879;&#x8FC7;&#x5EA6;&#x4F7F;&#x7528;reCAPTCHA&#x7684;&#x670D;&#x52A1;&#x611F;&#x5230;&#x975E;&#x5E38;&#x6CAE;&#x4E27;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x4ED6;&#x4EEC;&#x53D1;&#x8A93;&#x518D;&#x4E5F;&#x4E0D;&#x4F1A;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x4EE4;&#x4EBA;&#x4E0D;&#x5FEB;&#x7684;&#x7F51;&#x7AD9;&#x4E86;&#x3002;&#x8FD9;&#x4E9B;&#x4EBA;&#x901A;&#x5E38;&#x662F;<a href="https://www.w3.org/TR/turingtest/#version-2-are-you-a-robot" target="_blank">&#x65E0;&#x969C;&#x788D;</a>&#x7684;&#x667A;&#x80FD;&#x7528;&#x6237;&#xFF0C;&#x4ED6;&#x4EEC;&#x538C;&#x5026;&#x4E86;&#x88AB;&#x5F53;&#x4F5C;&#x5783;&#x573E;&#x7528;&#x6237;&#x5BF9;&#x5F85;&#xFF0C;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x3002;&#x5584;&#x5F85;&#x4F60;&#x7684;&#x7528;&#x6237;&#xFF0C;&#x5E76;&#x5E2E;&#x52A9;&#x5C06;&#x4ED6;&#x4EEC;&#x5FC5;&#x987B;&#x89E3;&#x51B3;&#x7684;reCAPTCHA&#x6570;&#x91CF;&#x964D;&#x5230;&#x6700;&#x4F4E;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x5141;&#x8BB8;&#x4ED6;&#x4EEC;&#x4F7F;&#x7528;Internet&#x3002;</p>
<p>&#x5982;&#x679C;&#x7528;&#x6237;&#x8BD5;&#x56FE;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x59A8;&#x788D;&#x8C37;&#x6B4C;&#x670D;&#x52A1;&#x548C;&#x8DDF;&#x8E2A;&#x7684;&#x8F6F;&#x4EF6;(&#x5982;VPN&#x3001;TBB&#x548C;&#x8BB8;&#x591A;&#x53CD;&#x8DDF;&#x8E2A;&#x6D4F;&#x89C8;&#x5668;&#x52A0;&#x8F7D;&#x9879;&#x548C;&#x4FEE;&#x6539;)&#x6765;&#x201C;&#x9009;&#x62E9;&#x201D;&#x8C37;&#x6B4C;&#x7684;&#x670D;&#x52A1;&#x548C;&#x8DDF;&#x8E2A;&#xFF0C;&#x90A3;&#x4E48;reCAPTCHA&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x56F0;&#x96BE;&#x3002;&#x4E3A;&#x4E86;&#x6F14;&#x793A;&#x201C;&#x975E;&#x5E38;&#x65E0;&#x804A;&#x201D;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x4E0B;&#x9762;&#x662F;&#x6211;&#x4F7F;&#x7528;TBB&#x89E3;&#x51B3;&#x4E00;&#x4E2A;reCAPTCHA&#x7684;&#x5B9E;&#x65F6;&#x8BB0;&#x5F55;&#xFF1A;</p>
<!-- ![](https://yylifen.github.io/sundries-trans/other/you-probably-dont-need-recaptcha/images/recaptcha-1.webm) -->
<video controls src="https://yylifen.github.io/sundries-trans/other/you-probably-dont-need-recaptcha/images/recaptcha-1.mp4"></video>

<p>&#x6211;&#x5F88;&#x5E78;&#x8FD0;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5B8C;&#x6210;&#x4E24;&#x9879;&#x6311;&#x6218;&#x3002;&#x6709;&#x65F6;&#x6709;&#x5341;&#x4E2A;&#x751A;&#x81F3;&#x66F4;&#x591A;&#x3002;&#x770B;&#x4E86;&#x4E0A;&#x9762;&#x7684;&#x89C6;&#x9891;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x60F3;&#xFF1A;&#x201C;&#x6211;&#x77E5;&#x9053;&#x7F51;&#x7EDC;&#x5F88;&#x6162;&#xFF0C;&#x4F46;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x5B83;&#x6709;&#x90A3;&#x4E48;&#x6162;&#xFF01;&#x201D;&#x4F60;&#x6CE8;&#x610F;&#x5230;&#x8FD9;&#x4E00;&#x5DEE;&#x5F02;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x5982;&#x679C;&#x6253;&#x5F00;WebDeveloper&#x63A7;&#x5236;&#x53F0;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5BF9;&#x4E8E;&#x65B0;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x6620;&#x50CF;&#x7684;HTTP&#x8BF7;&#x6C42;&#x53EA;&#x9700;&#x8981;&#x51E0;&#x767E;&#x6BEB;&#x79D2;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x8C37;&#x6B4C;&#x6DF7;&#x6DC6;&#x7684;JavaScript&#x6545;&#x610F;&#x6BCF;&#x6B21;&#x5C06;&#x65B0;&#x56FE;&#x50CF;&#x7684;&#x51FA;&#x73B0;&#x63A8;&#x8FDF;&#x51E0;&#x79D2;&#x949F;&#xFF0C;&#x6211;&#x786E;&#x4FE1;&#x8FD9;&#x4E0E;&#x673A;&#x5668;&#x4EBA;&#x88AB;&#x8FEB;&#x7B49;&#x5F85;&#x65F6;&#x653E;&#x5F03;&#x7684;&#x4E8B;&#x5B9E;&#x6709;&#x5173;&#x3002;&#x8FD9;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5BF9;&#x5F85;&#x90A3;&#x4E9B;&#x4E0D;&#x60F3;&#x505A;&#x65E0;&#x62A5;&#x916C;&#x52B3;&#x52A8;&#x7684;&#x7528;&#x6237;&#xFF0C;&#x5E76;&#x4E14;&#x88AB;&#x8C37;&#x6B4C;&#x8FDB;&#x884C;&#x6307;&#x7EB9;&#x8BC6;&#x522B;&#x3002;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x4E0A;&#x9762;&#x7684;&#x89C6;&#x9891;&#x5C55;&#x793A;&#x4E86;reCAPTCHA&#x7528;&#x6237;&#x4F53;&#x9A8C;(&#x4E00;&#x4E9B;<a href="https://greasyfork.org/en/scripts/31088-morecaptcha/code" target="_blank">&#x7528;&#x6237;&#x811A;&#x672C;</a>&#x53EF;&#x80FD;&#x6539;&#x8FDB;&#x7684;)&#x6700;&#x574F;&#x7684;&#x60C5;&#x51B5;&#x4E4B;&#x4E00;&#xFF0C;&#x5E76;&#x4E14;&#x666E;&#x901A;&#x7528;&#x6237;&#x7684;&#x4F53;&#x9A8C;&#x8981;&#x5FEB;&#x5F97;&#x591A;&#xFF0C;&#x53EA;&#x8981;&#x4ED6;&#x4EEC;&#x4E0D;&#x8BD5;&#x56FE;&#x963B;&#x6B62;Google&#x7684;&#x4EFB;&#x4F55;&#x8DDF;&#x8E2A;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x4F1A;&#x72AF;&#x5F88;&#x591A;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x8FD9;&#x79CD;&#x4E4F;&#x5473;&#x7684;&#x4E8B;&#x60C5;&#x4E4B;&#x5916;&#xFF0C;&#x7528;&#x6237;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;&#x5B9E;&#x9645;&#x52B3;&#x52A8;&#x76F4;&#x63A5;&#x7528;&#x4E8E;&#x4F7F;Google&#x53D7;&#x76CA;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x4E0D;&#x8981;&#x62C5;&#x5FC3;&#xFF0C;&#x56E0;&#x4E3A;&#x8C37;&#x6B4C;&#x6025;&#x4E8E;&#x5439;&#x5618;&#x4F60;&#x6240;&#x4ECE;&#x4E8B;&#x7684;&#x65E0;&#x79C1;&#x7684;&#x4EBA;&#x9053;&#x4E3B;&#x4E49;&#xFF0C;&#x9009;&#x62E9;&#x4E86;reCAPTCHA&#xFF0C;&#x5E76;&#x5728;&#x5176;&#x4E3B;<a href="https://developers.google.com/recaptcha/" target="_blank">&#x9875;&#x9762;</a>&#x4E2D;&#x8BF4;&#x660E;&#x4E86;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#xFF1A;</p>
<blockquote>
<p>&quot;&#x6570;&#x4EE5;&#x4EBF;&#x8BA1;&#x7684;&#x4E0A;&#x9650;&#x6BCF;&#x5929;&#x90FD;&#x88AB;&#x4EBA;&#x4EEC;&#x89E3;&#x51B3;&#x3002;reCAPTCHA&#x79EF;&#x6781;&#x5229;&#x7528;&#x4E86;&#x4EBA;&#x7C7B;&#x7684;&#x52AA;&#x529B;&#xFF0C;&#x5C06;&#x89E3;&#x51B3;&#x5361;&#x666E;&#x67E5;&#x95EE;&#x9898;&#x6240;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x7528;&#x4E8E;&#x6570;&#x5B57;&#x5316;&#x6587;&#x672C;&#x3001;&#x6CE8;&#x91CA;&#x56FE;&#x50CF;&#x3001;&#x5EFA;&#x7ACB;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6570;&#x636E;&#x96C6;&#x3002;&quot;</p>
</blockquote>
<p>&#x8FD9;&#x65E0;&#x7591;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x670D;&#x4F60;&#x5BF9;&#x5F3A;&#x8FEB;&#x4F60;&#x7684;&#x7528;&#x6237;&#x4ECE;&#x4E8B;&#x76F4;&#x63A5;&#x6709;&#x76CA;&#x4E8E;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x5F3A;&#x5927;&#x7684;&#x76D1;&#x89C6;&#x516C;&#x53F8;&#x7684;&#x65E0;&#x507F;&#x52B3;&#x52A8;&#x611F;&#x5230;&#x6EE1;&#x610F;&#x3002;reCAPTCHA&#x662F;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x9009;&#x62E9;&#x4E5F;&#x662F;&#x6709;&#x539F;&#x56E0;&#x7684;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;reCAPTCHA&#x8FD8;&#x662F;&#x5F88;&#x53D7;&#x6B22;&#x8FCE;&#x3002;&#x8FD9;&#x5E26;&#x6765;&#x4E86;&#x4E00;&#x4E9B;&#x597D;&#x5904;&#xFF0C;&#x4F46;&#x8FD9;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x9700;&#x8981;&#x82B1;&#x5F88;&#x5927;&#x7684;&#x52AA;&#x529B;&#x6765;&#x6253;&#x7834;reCAPTCHA&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x52AA;&#x529B;&#x90FD;&#x53EF;&#x80FD;&#x5F71;&#x54CD;&#x5230;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x4F60;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x5B9E;&#x73B0;&#x4E0E;&#x5176;&#x4ED6;&#x4E00;&#x767E;&#x4E07;&#x4E2A;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x591A;&#x5E74;&#x6765;&#x4ED6;&#x4EEC;<a href="https://uncaptcha.cs.umd.edu/papers/uncaptcha_woot17.pdf" target="_blank">&#x53D1;&#x8868;&#x4E86;</a><a href="https://www.blackhat.com/docs/asia-16/materials/asia-16-Sivakorn-Im-Not-a-Human-Breaking-the-Google-reCAPTCHA-wp.pdf" target="_blank">&#x8BB8;&#x591A;</a><a href="https://www.lancaster.ac.uk/staff/wangz3/publications/ccs18.pdf" target="_blank">&#x8BBA;&#x6587;</a>&#xFF0C;<a href="https://github.com/ecthros/uncaptcha" target="_blank">&#x4ED6;&#x4EEC;</a><a href="https://github.com/ecthros/uncaptcha2" target="_blank">&#x7834;&#x574F;&#x4E86;</a><a href="https://science.sciencemag.org/content/358/6368/eaag2612" target="_blank">reCAPTCHA</a>&#xFF0C;&#x901A;&#x5E38;Google&#x4F1A;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#xFF0C;&#x4EE5;&#x6539;&#x8FDB;&#x81EA;&#x5DF1;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x3002;&#x4E5F;&#x6709;<a href="https://www.deathbycaptcha.com/" target="_blank">&#x6709;&#x507F;</a><a href="https://www.deathbycaptcha.com/" target="_blank">&#x670D;&#x52A1;</a>&#xFF0C;&#x4F7F;&#x7528;&#x4EBA;&#x5DE5;&#x6765;&#x89E3;&#x51B3;&#x6536;&#x8D39;&#x5BA2;&#x6237;&#x7684;&#x9650;&#x989D;&#x95EE;&#x9898;&#xFF0C;&#x6BCF;&#x4EBA;&#x4E0D;&#x5230;&#x4E00;&#x5206;&#x94B1;&#x3002;&#x6709;&#x5173;&#x7ED5;&#x8FC7;reCAPTcha&#x7684;&#x73B0;&#x4EE3;&#x548C;&#x7528;&#x6237;&#x53CB;&#x597D;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x8BF7;&#x53C2;&#x89C1;Buster&#x3002;<a href="https://github.com/dessant/buster" target="_blank">Buster</a>&#x662F;&#x4E00;&#x4E2A;&#x73B0;&#x4EE3;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x6269;&#x5C55;(Firefox Chrome Opera)&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x4E3A;&#x4F60;&#x5B8C;&#x6210;reCAPTCHA&#x97F3;&#x9891;&#x6311;&#x6218;&#x6765;&#x5E2E;&#x52A9;&#x4F60;&#x89E3;&#x51B3;&#x56F0;&#x96BE;&#x7684;&#x4E0A;&#x9650;&#x3002;</p>
<h3 id="&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x9700;&#x8981;&#x9A8C;&#x8BC1;&#x7801;">&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x9700;&#x8981;&#x9A8C;&#x8BC1;&#x7801;</h3>
<p>&#x5728;&#x5B9E;&#x73B0;&#x9A8C;&#x8BC1;&#x7801;&#x4E4B;&#x524D;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x8003;&#x8651;&#x7684;&#x662F;&#x5426;&#x6709;&#x5FC5;&#x8981;&#x8FD9;&#x6837;&#x505A;&#x3002;&#x8981;&#x5E2E;&#x52A9;&#x8BC4;&#x4F30;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x8BF7;&#x8003;&#x8651;&#x4F60;&#x7684;&#x5A01;&#x80C1;&#x6A21;&#x578B;&#x662F;&#x5426;&#x5173;&#x5FC3;&#x81EA;&#x5B9A;&#x4E49;&#x6216;&#x672A;&#x5B9A;&#x5236;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x3002;&#x672A;&#x5B9A;&#x5236;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x666E;&#x904D;&#x5B58;&#x5728;&#x4E8E;&#x8BB8;&#x591A;Internet&#x534F;&#x8BAE;&#x4E2D;&#xFF0C;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x542F;&#x7528;HTTP&#x3001;SSH&#x6216;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x534F;&#x8BAE;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x5C06;&#x5F88;&#x5FEB;&#x9047;&#x5230;&#x5B83;&#x3002;&#x5B83;&#x901A;&#x5E38;&#x662F;&#x4E0D;&#x660E;&#x667A;&#x7684;&#xFF0C;&#x6267;&#x884C;&#x6210;&#x672C;&#x4F4E;&#xFF0C;&#x5BB9;&#x6613;&#x963B;&#x6B62;&#xFF0C;&#x5373;&#x4F7F;&#x6CA1;&#x6709;&#x4E0A;&#x9650;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5B9A;&#x5236;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x662F;&#x4E3A;&#x7279;&#x5B9A;&#x7684;&#x516C;&#x53F8;&#x3001;&#x670D;&#x52A1;&#x3001;&#x7F51;&#x7AD9;&#x6216;&#x7528;&#x6237;&#x800C;&#x7F16;&#x5199;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x3002;&#x7531;&#x4E8E;&#x5B9A;&#x5236;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x662F;&#x7531;&#x80FD;&#x591F;&#x4E3A;&#x4F60;&#x7684;&#x670D;&#x52A1;&#x91CF;&#x8EAB;&#x5B9A;&#x505A;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x6BD4;&#x672A;&#x5B9A;&#x5236;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x66F4;&#x5371;&#x9669;&#xFF0C;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x52AA;&#x529B;&#x624D;&#x80FD;&#x6709;&#x6548;&#x5730;&#x9650;&#x5236;&#x5B83;&#x3002;</p>
<p><strong>&#x8BB8;&#x591A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5927;&#x5927;&#x9AD8;&#x4F30;&#x4E86;&#x5B9A;&#x5236;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;</strong>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6709;&#x80FD;&#x529B;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x60F3;&#x8C61;&#x5982;&#x679C;&#x4F60;&#x7684;&#x670D;&#x52A1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x5949;&#x732E;&#x7CBE;&#x795E;&#xFF0C;&#x4EBA;&#x4EEC;&#x53EF;&#x4EE5;&#x6BEB;&#x4E0D;&#x8D39;&#x529B;&#x5730;&#x7528;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x6765;&#x6467;&#x6BC1;&#x4F60;&#x7684;&#x670D;&#x52A1;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x4E00;&#x4E2A;&#x6076;&#x610F;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x811A;&#x672C;&#xFF0C;&#x901A;&#x8FC7;&#x4F7F;&#x7528;Curl&#x548C;bash&#x5C31;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#x65E0;&#x6CD5;&#x62D2;&#x7EDD;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x3002;&#x5373;&#x4F7F;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x9A8C;&#x8BC1;&#x7801;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x4ED6;&#x4EEC;&#x4F7F;&#x7528;OCR&#x6216;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x81EA;&#x52A8;&#x7ED5;&#x8FC7;&#x5B83;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x4EE3;&#x7406;&#x548C;VPN&#x81EA;&#x52A8;&#x7ED5;&#x8FC7;&#x4F60;&#x7684;IP&#x901F;&#x7387;&#x9650;&#x5236;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x5BCC;&#x6709;&#x60F3;&#x8C61;&#x529B;&#x7684;&#x604D;&#x60DA;&#x72B6;&#x6001;&#x4E2D;&#xFF0C;&#x4F60;&#x5DF2;&#x7ECF;&#x5FD8;&#x8BB0;&#x4E86;99%&#x7684;&#x7528;&#x6237;&#x6839;&#x672C;&#x4E0D;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x751A;&#x81F3;&#x4E0D;&#x77E5;&#x9053;Curl&#x6216;HTTP&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4F60;&#x7684;&#x670D;&#x52A1;&#x5F88;&#x53EF;&#x80FD;&#x7ED9;&#x90A3;&#x4E9B;&#x6709;&#x80FD;&#x529B;&#x7684;&#x653B;&#x51FB;&#x8005;&#x63D0;&#x4F9B;&#x5F88;&#x5C11;&#x7684;&#x6F5C;&#x5728;&#x56DE;&#x62A5;&#x3002;</p>
<p>&#x4EC5;&#x4EC5;&#x56E0;&#x4E3A;&#x6709;&#x4EBA;&#x53EF;&#x80FD;&#x82B1;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#xFF08;&#x6216;&#x51E0;&#x5206;&#x949F;&#xFF09;&#x7F16;&#x5199;&#x7A0B;&#x5E8F;&#x6765;&#x7ED9;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#x53D1;&#x9001;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x4F1A;&#x3002;&#x4F60;&#x5173;&#x4E8E;&#x6700;&#x65B0;&#x7684;&#x852C;&#x83DC;&#x718F;&#x8089;&#x7684;&#x4E2A;&#x4EBA;&#x535A;&#x5BA2;&#x5BF9;&#x4EFB;&#x4F55;&#x4EBA;&#x6765;&#x8BF4;&#x90FD;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x9AD8;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x76EE;&#x6807;&#x3002;&#x5C06;ReCAPTCHA&#x6DFB;&#x52A0;&#x5230;&#x4F60;&#x7684;&#x8054;&#x7CFB;&#x6211;&#x9875;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x4E0D;&#x80FD;&#x4E0E;&#x4F60;&#x4EA4;&#x8C08;&#x3002;&#x6211;&#x5DF2;&#x7ECF;&#x8FD0;&#x884C;&#x4E86;&#x51E0;&#x4E2A;&#x62E5;&#x6709;&#x6570;&#x767E;&#x4E07;&#x9875;&#x9762;&#x89C6;&#x56FE;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x8FD9;&#x4E9B;&#x7F51;&#x9875;&#x89C6;&#x56FE;&#x5DF2;&#x6536;&#x5230;&#x96F6;&#x81EA;&#x5B9A;&#x4E49;&#x6EE5;&#x7528;&#xFF0C;&#x5E76;&#x4E0E;&#x5176;&#x4ED6;&#x5177;&#x6709;&#x7C7B;&#x4F3C;&#x4F53;&#x9A8C;&#x7684;&#x7F51;&#x7AD9;&#x7BA1;&#x7406;&#x5458;&#x4EA4;&#x8C08;&#x3002;codingferror.com&#x7684;JeffAtwood<a href="https://blog.codinghorror.com/captcha-effectiveness/" target="_blank">&#x66FE;&#x5199;&#x8FC7;</a>&#xFF1A;</p>
<blockquote>
<p>&#x6211;&#x7684;&#x535A;&#x5BA2;&#x7684;&#x8BC4;&#x8BBA;&#x5F62;&#x5F0F;&#x53D7;&#x5230;&#x6211;&#x6240;&#x8BF4;&#x7684;&#x201C;&#x7EAF;&#x9A8C;&#x8BC1;&#x7801;&#x201D;&#x7684;&#x4FDD;&#x62A4;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9A8C;&#x8BC1;&#x7801;&#x6BCF;&#x6B21;&#x90FD;&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;&#x8FD9;&#x5FC5;&#x987B;&#x662F;&#x6709;&#x53F2;&#x4EE5;&#x6765;&#x6700;&#x65E0;&#x6548;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#xFF0C;&#x4F46;&#x5B83;&#x963B;&#x6B62;&#x4E86;99.9%&#x7684;&#x8BC4;&#x8BBA;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x4E0D;&#x662F;&#x5EFA;&#x8BAE;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x505A;&#xFF0C;&#x5FFD;&#x89C6;&#x57FA;&#x672C;&#x5B89;&#x5168;&#xFF0C;&#x5BF9;&#x653B;&#x51FB;&#x6BEB;&#x65E0;&#x51C6;&#x5907;&#xFF0C;&#x800C;&#x662F;&#x73B0;&#x5B9E;&#x5730;&#x8003;&#x8651;&#x4F60;&#x7684;&#x5A01;&#x80C1;&#x6A21;&#x578B;&#xFF0C;&#x5E76;&#x53EA;&#x5427;&#x9A8C;&#x8BC1;&#x7801;&#x5E94;&#x7528;&#x5230;&#x5FC5;&#x8981;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<h3 id="&#x672A;&#x5B9A;&#x5236;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x7684;recaptcha&#x66FF;&#x4EE3;&#x65B9;&#x6848;">&#x672A;&#x5B9A;&#x5236;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x7684;reCAPTCHA&#x66FF;&#x4EE3;&#x65B9;&#x6848;</h3>
<p>&#x5BF9;&#x4E8E;&#x672A;&#x5B9A;&#x5236;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#xFF0C;&#x5F88;&#x5C11;&#x9700;&#x8981;&#x5B8C;&#x6574;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x5B9E;&#x73B0;&#x3002;&#x672C;&#x8282;&#x5217;&#x51FA;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x6709;&#x6548;&#x7684;&#x6280;&#x5DE7;&#xFF0C;&#x4EE5;&#x963B;&#x6B62;&#x5927;&#x591A;&#x6570;&#x672A;&#x5B9A;&#x5236;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x5F71;&#x54CD;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#x3002;</p>
<p><strong>&#x9690;&#x85CF;&#x8868;&#x5355;&#x5143;&#x7D20;</strong></p>
<p>&#x672A;&#x5B9A;&#x5236;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x4E0D;&#x591F;&#x667A;&#x80FD;&#xFF0C;&#x65E0;&#x6CD5;&#x77E5;&#x9053;&#x4F55;&#x65F6;&#x5E94;&#x8BE5;&#x586B;&#x5199;&#x8868;&#x5355;&#x5143;&#x7D20;&#x6216;&#x4E0D;&#x5E94;&#x8BE5;&#x586B;&#x5199;&#x8868;&#x5355;&#x5143;&#x7D20;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6DFB;&#x52A0;&#x540D;&#x4E3A;&#x201C;url&#x201D;&#x7684;&#x8868;&#x5355;&#x5143;&#x7D20;&#x5E76;&#x5C06;&#x5176;&#x9690;&#x85CF;&#x5728;CSS&#x4E2D;&#xFF0C;&#x5141;&#x8BB8;&#x4F60;&#x62D2;&#x7EDD;&#x4F7F;&#x7528;&#x5B83;&#x586B;&#x5145;&#x7684;&#x4EFB;&#x4F55;&#x8BF7;&#x6C42;&#xFF08;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x6E34;&#x671B;&#x6267;&#x884C;&#xFF09;&#x3002;&#x8981;&#x4FDD;&#x6301;&#x53EF;&#x8BBF;&#x95EE;&#x6027;&#xFF0C;&#x8BF7;&#x786E;&#x4FDD;&#x5411;&#x8BE5;&#x5143;&#x7D20;&#x6DFB;&#x52A0;&#x6807;&#x7B7E;&#xFF0C;&#x4EE5;&#x4FBF;&#x4F7F;&#x7528;&#x5C4F;&#x5E55;&#x9605;&#x8BFB;&#x5668;&#x7684;&#x7528;&#x6237;&#x4E0D;&#x4F1A;&#x586B;&#x5199;&#x8BE5;&#x6807;&#x7B7E;&#x3002;&#x5176;&#x4ED6;&#x826F;&#x597D;&#x7684;&#x9690;&#x85CF;&#x8868;&#x5355;&#x5143;&#x7D20;&#x540D;&#x79F0;&#x5305;&#x62EC;&#x201C;&#x7F51;&#x7AD9;&#x201D;&#x3001;&#x201C;firstname&#x201D;&#x3001;&#x201C;lastname&#x201D;&#x3001;&#x201C;email&#x201D;&#x548C;&#x201C;name&#x201D;&#xFF0C;&#x9664;&#x975E;&#x5B83;&#x4EEC;&#x5DF2;&#x5408;&#x6CD5;&#x4F7F;&#x7528;&#x3002;</p>
<p><strong>&#x9759;&#x6001;&#x95EE;&#x9898;</strong></p>
<p>&#x672A;&#x5B9A;&#x5236;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x7684;&#x4E0D;&#x667A;&#x80FD;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x4ED6;&#x4EEC;&#x4E0D;&#x80FD;&#x6B63;&#x786E;&#x56DE;&#x7B54;&#x7B80;&#x5355;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x201C;&#x4EC0;&#x4E48;&#x662F;23&#xFF1F;&#x201D;&#xFF0C;&#x6216;&#x8005;&#x201C;&#x8FD9;&#x4E2A;&#x7F51;&#x7AD9;&#x7684;&#x540D;&#x5B57;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x201D;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x6709;&#x6548;&#x5730;&#x963B;&#x6B62;&#x4E86;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x672A;&#x5B9A;&#x5236;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x3002;&#x5E38;&#x7528;&#x7684;&#x8F6F;&#x4EF6;&#x6808;&#xFF0C;&#x5982;WordPress&#x548C;Drupal&#x90FD;&#x6709;<a href="https://wordpress.org/plugins/wp-math-captcha/" target="_blank">&#x514D;&#x8D39;&#x7684;</a><a href="https://www.drupal.org/project/riddler" target="_blank">&#x63D2;&#x4EF6;</a>&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5FEB;&#x901F;&#x521B;&#x5EFA;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p><strong>&#x793E;&#x533A;&#x7279;&#x5B9A;&#x95EE;&#x9898;</strong></p>
<p>&#x5982;&#x679C;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#x662F;&#x4EE5;&#x793E;&#x533A;&#x4E3A;&#x4E2D;&#x5FC3;&#x7684;&#xFF0C;&#x5982;&#x8BBA;&#x575B;&#x6216;&#x535A;&#x5BA2;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x95EE;&#x4E00;&#x4E2A;&#x793E;&#x533A;&#x7279;&#x5B9A;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x793E;&#x533A;&#x7684;&#x6F5C;&#x5728;&#x6210;&#x5458;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x7B54;&#x6848;&#x3002;&#x8FD9;&#x662F;&#x963B;&#x6B62;&#x7528;&#x6237;&#x52A0;&#x5165;&#x4F60;&#x8BA4;&#x4E3A;&#x4E0D;&#x5E94;&#x8BE5;&#x53C2;&#x4E0E;&#x7684;&#x793E;&#x533A;&#x7684;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x800C;&#x4F1F;&#x5927;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x7F3A;&#x4E4F;&#x57FA;&#x672C;&#x7684;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x65E0;&#x6CD5;&#x6216;&#x4E0D;&#x613F;&#x610F;&#x5B66;&#x4E60;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x7FA4;&#x6570;&#x5B66;&#x5BB6;&#x53EF;&#x80FD;&#x4F1A;&#x8981;&#x6C42;&#x7528;&#x6237;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x516C;&#x5F0F;&#x6216;&#x6C42;&#x89E3;&#x4E00;&#x4E2A;&#x65B9;&#x7A0B;&#xFF0C;&#x7ED9;&#x51FA;&#x5B83;&#x7684;&#x56FE;&#x50CF;&#x3002;</p>
<p><img src="https://yylifen.github.io/sundries-trans/other/you-probably-dont-need-recaptcha/images/complex_captcha.gif" alt=""></p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x662F;&#xFF0C;&#x4E00;&#x7FA4;&#x5C0F;&#x4F17;&#x5A92;&#x4F53;&#x9274;&#x8D4F;&#x5BB6;&#x793E;&#x533A;&#x53EF;&#x80FD;&#x4F1A;&#x8981;&#x6C42;&#x7528;&#x6237;&#x8BC6;&#x522B;&#x4ED6;&#x4EEC;&#x8BA4;&#x4E3A;&#x5BF9;&#x4ED6;&#x4EEC;&#x5171;&#x540C;&#x6587;&#x5316;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x67D0;&#x4E2A;&#x7279;&#x5F81;&#x3002;</p>
<p><img src="https://yylifen.github.io/sundries-trans/other/you-probably-dont-need-recaptcha/images/anime_captca.jpg" alt=""></p>
<blockquote>
<p>&#x793E;&#x4F1A;&#x6210;&#x5458;&#x7684;&#x8D28;&#x7D20;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x3002;</p>
</blockquote>
<p><strong>JavaScript</strong></p>
<p>&#x6211;&#x662F;&#x5426;&#x63D0;&#x5230;&#x4E86;&#x672A;&#x7ECF;&#x5B9A;&#x5236;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x662F;&#x4E0D;&#x79D1;&#x5B66;&#x7684;&#xFF1F;&#x57FA;&#x7840;&#x7684;JavaScript&#x4E0D;&#x662F;&#x7531;&#x5927;&#x591A;&#x6570;&#x672A;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x6267;&#x884C;&#x6216;&#x89E3;&#x6790;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x4F7F;&#x7528;&#x5B83;&#x8BA1;&#x7B97;&#x8868;&#x5355;&#x5143;&#x7D20;&#x7684;&#x503C;&#x4E5F;&#x662F;&#x6709;&#x6548;&#x7684;&#x3002;JavaScript&#x8FD8;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x63D0;&#x4EA4;&#x8868;&#x5355;&#x672C;&#x8EAB;&#x3001;&#x6B63;&#x786E;&#x8BBE;&#x7F6E;CSRF&#x4EE4;&#x724C;&#x6216;&#x6267;&#x884C;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x7B80;&#x5355;&#x4EFB;&#x52A1;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x7AD9;&#x70B9;&#x6709;&#x8BB8;&#x591A;&#x7528;&#x6237;&#x7981;&#x7528;&#x4E86;JavaScript&#xFF0C;&#x5219;&#x6700;&#x597D;&#x63D0;&#x4F9B;&#x53E6;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p><strong>&#x7B2C;&#x4E09;&#x65B9;&#x670D;&#x52A1;</strong></p>
<p>&#x4ECE;WordPress&#x63D2;&#x4EF6;(&#x5982;<a href="https://akismet.com/get/" target="_blank">AKismet</a>)&#x3001;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x68C0;&#x6D4B;API(&#x5982;<a href="https://www.stopforumspam.com/" target="_blank">StopForumSpam</a>)&#xFF0C;&#x4EE5;&#x53CA;&#x8BC4;&#x4F30;&#x7528;&#x6237;&#x6216;IP(&#x5982;<a href="https://www.abuseipdb.com/about" target="_blank">abuseIPDB</a>)&#x7684;API&#xFF0C;&#x6709;&#x8BB8;&#x591A;&#x514D;&#x8D39;(&#x548C;&#x4ED8;&#x8D39;)&#x7B2C;&#x4E09;&#x65B9;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x4EE5;&#x5927;&#x591A;&#x6570;&#x7528;&#x6237;&#x770B;&#x4E0D;&#x5230;&#x7684;&#x65B9;&#x5F0F;&#x963B;&#x6B62;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x3002;</p>
<h3 id="&#x81EA;&#x5B9A;&#x4E49;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x7684;recaptcha&#x66FF;&#x4EE3;&#x65B9;&#x6848;">&#x81EA;&#x5B9A;&#x4E49;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x7684;reCAPTCHA&#x66FF;&#x4EE3;&#x65B9;&#x6848;</h3>
<p>&#x5982;&#x679C;&#x4F60;&#x7684;&#x7ECF;&#x8425;&#x89C4;&#x6A21;&#x8DB3;&#x591F;&#x5927;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x5982;&#x679C;&#x81EA;&#x52A8;&#x4F7F;&#x7528;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#x672C;&#x8EAB;&#x5C31;&#x8DB3;&#x591F;&#x6709;&#x5229;&#x53EF;&#x56FE;&#xFF0C;&#x90A3;&#x4E48;&#x5B9A;&#x5236;&#x7684;&#x6EE5;&#x7528;&#x6700;&#x7EC8;&#x4F1A;&#x56E0;&#x4E3A;&#x67D0;&#x79CD;&#x539F;&#x56E0;&#x800C;&#x53D1;&#x751F;&#x3002;<strong>&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x9A8C;&#x8BC1;&#x7801;&#x53EA;&#x662F;&#x5E2E;&#x52A9;&#x9A8C;&#x8BC1;&#x7ED9;&#x5B9A;&#x7528;&#x6237;&#x662F;&#x4EBA;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x5B83;&#x4E0D;&#x662F;&#x552F;&#x4E00;&#x7684;&#x5DE5;&#x5177;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5B83;&#x4E5F;&#x4E0D;&#x662F;&#x9002;&#x5408;&#x6BCF;&#x4E00;&#x4E2A;&#x7528;&#x4F8B;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x5B8C;&#x7F8E;&#x7684;&#xFF0C;&#x53EA;&#x5E0C;&#x671B;&#x53EF;&#x4EE5;&#x963B;&#x6B62;&#x66F4;&#x591A;&#x7684;&#x653B;&#x51FB;&#x8005;&#x6EE5;&#x7528;&#x4F60;&#x7684;&#x670D;&#x52A1;&#x3002;</strong>&#x672C;&#x8282;&#x6309;&#x590D;&#x6742;&#x7A0B;&#x5EA6;&#x5927;&#x81F4;&#x589E;&#x52A0;&#x7684;&#x987A;&#x5E8F;&#x5217;&#x51FA;&#x4E86;reCAPTCHA&#x7684;&#x4E00;&#x4E9B;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x3002;</p>
<p><strong>Django&#x7B80;&#x5355;&#x7684;&#x9A8C;&#x8BC1;&#x7801;</strong></p>
<p><a href="https://github.com/mbi/django-simple-captcha" target="_blank">Django&#x7B80;&#x5355;&#x7684;&#x9A8C;&#x8BC1;&#x7801;</a>&#x4E3A;Django&#x9879;&#x76EE;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x3002;</p>
<p><img src="https://yylifen.github.io/sundries-trans/other/you-probably-dont-need-recaptcha/images/django_simple_captcha.png" alt=""></p>
<blockquote>
<p>Django&#x7B80;&#x5355;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#xFF0C;&#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x5DF2;&#x7ECF;&#x963B;&#x6B62;&#x4E86;&#x8BB8;&#x591A;&#x653B;&#x51FB;&#x8005;&#x3002;</p>
</blockquote>
<p><strong>Laravel5&#x7684;&#x9A8C;&#x8BC1;&#x7801;</strong></p>
<p><a href="https://github.com/mewebstudio/captcha" target="_blank">Laravel5&#x7684;&#x9A8C;&#x8BC1;&#x7801;</a>&#x4E3A;Laravel&#x9879;&#x76EE;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x53EF;&#x5B9A;&#x5236;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x3002;</p>
<p><img src="https://yylifen.github.io/sundries-trans/other/you-probably-dont-need-recaptcha/images/laravel_captcha.png" alt=""></p>
<blockquote>
<p>Laravel5&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#xFF0C;&#x662F;&#x53EF;&#x5B9A;&#x5236;&#x7684;</p>
</blockquote>
<p><strong>&#x7279;&#x5B9A;&#x4E8E;CMS&#x7684;&#x9A8C;&#x8BC1;&#x7801;</strong></p>
<p>&#x6D41;&#x884C;&#x7684;CMS&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x901A;&#x5E38;&#x5177;&#x6709;&#x9002;&#x5408;&#x4E8E;&#x57FA;&#x672C;&#x76EE;&#x7684;&#x7684;&#x81F3;&#x5C11;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x63D2;&#x4EF6;&#x3002;&#x4EE5;&#x4E0B;&#x662F;<a href="https://wordpress.org/plugins/really-simple-captcha/" target="_blank">WordPress</a>&#x3001;<a href="https://www.drupal.org/project/draggable_captcha" target="_blank">Drupal</a>&#x548C;<a href="https://www.phpcaptcha.org/try-securimage/" target="_blank">&#x901A;&#x7528;PHP</a>&#x7684;&#x4E00;&#x4E9B;&#x793A;&#x4F8B;&#x3002;</p>
<p><img src="https://yylifen.github.io/sundries-trans/other/you-probably-dont-need-recaptcha/images/phpcaptcha.png" alt=""></p>
<blockquote>
<p>PHP&#x5B89;&#x5168;&#x56FE;&#x50CF;&#x9A8C;&#x8BC1;&#x7801;</p>
</blockquote>
<p><img src="https://yylifen.github.io/sundries-trans/other/you-probably-dont-need-recaptcha/images/drupal_captcha.png" alt=""></p>
<blockquote>
<p>Drupal&#x5339;&#x914D;+&#x5E7B;&#x706F;&#x7247;&#x9A8C;&#x8BC1;&#x7801;</p>
</blockquote>
<p><strong>&#x81EA;&#x5B9A;&#x4E49;JavaScript&#x811A;&#x672C;&#x529F;&#x80FD;</strong></p>
<p>&#x6B63;&#x5982;&#x57FA;&#x7840;&#x7684;JavaScript&#x811A;&#x672C;&#x505C;&#x6B62;&#x5927;&#x591A;&#x6570;&#x672A;&#x5B9A;&#x5236;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x4E00;&#x6837;&#xFF0C;&#x66F4;&#x9AD8;&#x7EA7;&#x7684;&#x811A;&#x672C;&#x4E5F;&#x53EF;&#x4EE5;&#x963B;&#x6B62;&#x5927;&#x91CF;&#x5B9A;&#x5236;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6709;&#x4E9B;&#x7F51;&#x7AD9;&#x8981;&#x6C42;&#x4F60;&#x6ED1;&#x52A8;jQuery&#x6ED1;&#x5757;&#x5143;&#x7D20;&#x624D;&#x80FD;&#x6210;&#x529F;&#x63D0;&#x4EA4;&#x8868;&#x5355;&#x3002;&#x5BF9;&#x4E8E;<a href="https://wordpress.org/plugins/slider-captcha/" target="_blank">WordPress</a>&#x3001;<a href="https://github.com/ist-dsi/jquery-ui-slider-captcha" target="_blank">jQuery</a>(<a href="https://jqueryui.com/slider/" target="_blank">jQueryUI&#x6ED1;&#x5757;</a>&#x3001;<a href="https://github.com/seiyria/bootstrap-slider" target="_blank">&#x5F15;&#x5BFC;&#x6ED1;&#x5757;</a>)&#x3001;<a href="https://catalogo-onlinersi.net/en/add-ons-prestashop-modules/264-slide-captcha-prestashop-module.html" target="_blank">Prestashop</a>&#x3001;<a href="https://www.npmjs.com/package/slider-puzzle-captcha" target="_blank">Node</a>&#x7B49;&#x7B49;&#x8FD9;&#x6837;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E9B;&#x793A;&#x4F8B;&#x53EF;&#x80FD;&#x4E0D;&#x9002;&#x5408;&#x751F;&#x4EA7;&#x4F7F;&#x7528;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x8FD8;&#x6CA1;&#x6709;&#x5BF9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002;</p>
<p><img src="https://yylifen.github.io/sundries-trans/other/you-probably-dont-need-recaptcha/images/slider.png" alt=""></p>
<blockquote>
<p>&#x6ED1;&#x5230;&#x89E3;&#x9501;</p>
</blockquote>
<p>&#x53EA;&#x8981;&#x5C06;&#x771F;&#x6B63;&#x7684;JavaScript&#x8BC4;&#x4F30;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x9700;&#x6C42;&#xFF0C;&#x5C31;&#x4F1A;&#x63D0;&#x9AD8;&#x653B;&#x51FB;&#x8005;&#x7684;&#x95E8;&#x69DB;&#xFF0C;&#x5E76;&#x4E14;&#x65E0;&#x9700;&#x7528;&#x6237;&#x6267;&#x884C;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#x5373;&#x53EF;&#x5B8C;&#x6210;&#x3002;&#x5982;&#x679C;&#x4F60;&#x9009;&#x62E9;&#x7F16;&#x5199;&#x5927;&#x91CF;&#x81EA;&#x5B9A;&#x4E49;&#x524D;&#x7AEF;&#x4EE3;&#x7801;&#x6765;&#x8BC4;&#x4F30;&#x7528;&#x6237;&#xFF0C;&#x8BF7;&#x786E;&#x4FDD;&#x5BF9;&#x6BCF;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x8BBE;&#x5907;&#x548C;&#x65E5;&#x5FD7;&#x6545;&#x969C;&#x8FDB;&#x884C;&#x5E7F;&#x6CDB;&#x7684;&#x7528;&#x6237;&#x6D4B;&#x8BD5;&#xFF0C;&#x4EE5;&#x4FBF;&#x5BF9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x6D88;&#x9664;&#x9519;&#x8BEF;&#x3002;</p>
<p><strong>Capy&#x62FC;&#x56FE;&#x9A8C;&#x8BC1;&#x7801;</strong></p>
<p><a href="https://www.capy.me/products/puzzle_captcha/" target="_blank">Capy</a>&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x62FC;&#x56FE;&#x9A8C;&#x8BC1;&#x7801;&#xFF0C;&#x5B83;&#x8981;&#x6C42;&#x7528;&#x6237;&#x5C06;&#x4E00;&#x4E2A;&#x62FC;&#x56FE;&#x5757;&#x62D6;&#x5230;&#x4E00;&#x4E2A;&#x7A7A;&#x69FD;&#x4E2D;&#x3002;</p>
<p><img src="https://yylifen.github.io/sundries-trans/other/you-probably-dont-need-recaptcha/images/capy.png" alt=""></p>
<blockquote>
<p>&#x4E0D;&#x8D39;&#x5439;&#x7070;&#x4E4B;&#x529B;&#x5C31;&#x80FD;&#x5B8C;&#x6210;&#x62FC;&#x56FE;&#x7684;&#x6240;&#x6709;&#x4E50;&#x8DA3;</p>
</blockquote>
<p><strong>SolveMedia</strong></p>
<p><a href="https://www.solvemedia.com/publishers/captcha-type-in" target="_blank">SolveMedia</a>&#x4E3A;&#x5404;&#x79CD;&#x6D41;&#x884C;&#x7684;&#x8F6F;&#x4EF6;&#x6808;&#x63D0;&#x4F9B;&#x4E86;&#x9A8C;&#x8BC1;&#x7801;&#x548C;&#x76F8;&#x5E94;&#x7684;&#x63D2;&#x4EF6;&#xFF0C;&#x5305;&#x62EC;vBulletin&#x3001;WordPress&#x3001;MediaWiki&#x3001;Dupal&#x3001;Joomla&#x7B49;&#x3002;&#x9A8C;&#x8BC1;&#x7801;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x7528;&#x6237;&#x7684;&#x5A01;&#x80C1;&#x5206;&#x6570;&#x6765;&#x7F29;&#x653E;&#x5176;&#x96BE;&#x5EA6;&#x3002;</p>
<p><img src="https://yylifen.github.io/sundries-trans/other/you-probably-dont-need-recaptcha/images/solvemedia.png" alt=""></p>
<blockquote>
<p>&#x4ED6;&#x4F1A;&#x5728;&#x4F60;&#x6700;&#x4E0D;&#x7ECF;&#x610F;&#x7684;&#x65F6;&#x5019;&#x6765;&#x7684;</p>
</blockquote>
<p>&#x5982;&#x679C;&#x51FA;&#x4E8E;&#x67D0;&#x79CD;&#x539F;&#x56E0;&#xFF0C;&#x4F60;&#x89C9;&#x5F97;&#x6709;&#x5FC5;&#x8981;&#x4ECE;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#x83B7;&#x5229;&#xFF0C;&#x8BF7;&#x4E0D;&#x8981;&#x62C5;&#x5FC3;&#xFF0C;&#x56E0;&#x4E3A;&#x4E5F;&#x6709;&#x9002;&#x5408;&#x5C0F;&#x90E8;&#x5206;&#x7684;<a href="https://i.imgur.com/TEdBeDa.png" target="_blank">&#x8D44;&#x672C;&#x4E3B;&#x4E49;</a><a href="https://i.imgur.com/dgGvgKF.png" target="_blank">&#x53CD;&#x4E4C;&#x6258;&#x90A6;</a>&#x7684;&#x7248;&#x672C;&#xFF1A;</p>
<p><img src="https://yylifen.github.io/sundries-trans/other/you-probably-dont-need-recaptcha/images/solvemedia_evil.png" alt=""></p>
<blockquote>
<p>&#x8BF7;&#x56DE;&#x7B54;&#x8FD9;&#x4E2A;&#x9A8C;&#x8BC1;&#x95EE;&#x9898;</p>
</blockquote>
<p><strong>Geetest</strong></p>
<p><a href="https://www.geetest.com/en/" target="_blank">Geetest</a>&#x4F3C;&#x4E4E;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E9B;&#x6307;&#x7EB9;&#x6280;&#x672F;&#xFF0C;&#x4F46;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#x7684;&#x6548;&#x679C;&#x7C7B;&#x4F3C;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x62FC;&#x56FE;&#x9A8C;&#x8BC1;&#x7801;&#x3002;&#x5B83;&#x56E0;&#x4E3A;&#x5728;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x5927;&#x7684;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x4EA4;&#x6613;&#x6240;&#x4E4B;&#x4E00;&#x4E0A;&#x4F7F;&#x7528;&#x800C;&#x95FB;&#x540D;&#x3002;</p>
<p><img src="https://yylifen.github.io/sundries-trans/other/you-probably-dont-need-recaptcha/images/geetest.png" alt=""></p>
<p>&#x8FD9;&#x4E2A;&#x5217;&#x8868;&#x6BD4;&#x8F83;&#x5168;&#x9762;&#xFF0C;&#x8BB8;&#x591A;&#x7C7B;&#x4F3C;&#x7684;&#x6355;&#x83B7;&#x88AB;&#x6392;&#x9664;&#x5728;&#x5176;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x4F60;&#x662F;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x8BA4;&#x4E3A;&#x8BB8;&#x591A;&#x8FD9;&#x4E9B;&#x6355;&#x83B7;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8F6F;&#x4EF6;&#x89E3;&#x51B3;&#xFF0C;&#x867D;&#x7136;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x4F46;&#x5374;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x89E3;&#x51B3;&#x3002;&#x4ECE;&#x7406;&#x8BBA;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x9A8C;&#x8BC1;&#x7801;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x7F8E;&#x7684;turing&#x6D4B;&#x8BD5;&#xFF0C;&#x4F46;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x5B83;&#x4EEC;&#x53EA;&#x662F;&#x7528;&#x6765;&#x4F7F;&#x653B;&#x51FB;&#x4F60;&#x7684;&#x670D;&#x52A1;&#x66F4;&#x52A0;&#x56F0;&#x96BE;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x4E0D;&#x518D;&#x5177;&#x6709;&#x6210;&#x672C;&#x6548;&#x76CA;&#x3002;&#x5373;&#x4F7F;&#x662F;&#x5B8C;&#x7F8E;&#x7684;&#x6355;&#x83B7;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x963B;&#x6B62;&#x4E00;&#x5207;&#x653B;&#x51FB;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x8FD0;&#x884C;&#x975E;&#x5E38;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x5426;&#x5219;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x611F;&#x5230;&#x60CA;&#x8BB6;&#x7684;&#x662F;&#xFF0C;&#x653B;&#x51FB;&#x8005;&#x613F;&#x610F;&#x6267;&#x884C;JavaScript&#x811A;&#x672C;&#x6216;&#x6267;&#x884C;OCR&#x4EE5;&#x81EA;&#x52A8;&#x653B;&#x51FB;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#x3002;</p>
<h3 id="&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x6700;&#x4F73;&#x505A;&#x6CD5;">&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x6700;&#x4F73;&#x505A;&#x6CD5;</h3>
<p>&#x5982;&#x679C;&#x4F60;&#x5DF2;&#x7ECF;&#x786E;&#x5B9A;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x9A8C;&#x8BC1;&#x7801;&#xFF0C;&#x90A3;&#x4E48;&#x8BF7;&#x8003;&#x8651;&#x662F;&#x5426;&#x771F;&#x7684;&#x6709;&#x5FC5;&#x8981;&#x5728;&#x6240;&#x6709;&#x4F60;&#x60F3;&#x8981;&#x63A7;&#x5236;&#x81EA;&#x52A8;&#x5316;&#x7684;&#x5730;&#x65B9;&#x5B9E;&#x73B0;&#x5B83;&#x3002;&#x5411;&#x7528;&#x6237;&#x663E;&#x793A;&#x66F4;&#x5C11;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x4E0D;&#x4EC5;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x63D0;&#x9AD8;&#x4E86;KPI(&#x5982;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x548C;&#x7528;&#x6237;&#x7559;&#x5B58;)&#x3002;</p>
<p><strong>&#x5728;&#x53EF;&#x80FD;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x9650;&#x5236;&#x4F7F;&#x7528;&#x9891;&#x7387;</strong></p>
<p>&#x7531;&#x4E8E;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x76EE;&#x7684;&#x662F;&#x786E;&#x8BA4;&#x6700;&#x7EC8;&#x7528;&#x6237;&#x662F;&#x4EBA;&#xFF0C;&#x7528;&#x6237;&#x901A;&#x5E38;&#x53EA;&#x9700;&#x6B63;&#x786E;&#x89E3;&#x51B3;&#x4E00;&#x6B21;&#x6355;&#x83B7;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x9650;&#x5236;&#x67D0;&#x4E2A;&#x64CD;&#x4F5C;&#x4EE5;&#x786E;&#x4FDD;&#x7528;&#x6237;&#x4E0D;&#x4F1A;&#x9891;&#x7E41;&#x6267;&#x884C;&#x8BE5;&#x64CD;&#x4F5C;&#xFF0C;&#x8BF7;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x9891;&#x7387;&#x9650;&#x5236;&#x4F5C;&#x4E3A;&#x5907;&#x9009;&#x65B9;&#x6848;&#xFF08;&#x6216;&#x4E0E;captchcha&#x7ED3;&#x5408;&#x4F7F;&#x7528;&#xFF09;&#x3002;</p>
<p><strong>&#x9A8C;&#x8BC1;&#x7801;&#x4F7F;&#x7528;&#x5408;&#x7406;&#x7684;&#x9608;&#x503C;</strong></p>
<p>&#x4E3A;&#x8981;&#x7528;&#x9A8C;&#x8BC1;&#x7801;&#x9650;&#x5236;&#x7684;&#x64CD;&#x4F5C;&#x8BBE;&#x7F6E;&#x5408;&#x7406;&#x7684;&#x9608;&#x503C;&#x3002;&#x4E0D;&#x8981;&#x5728;&#x4E00;&#x6B21;&#x5931;&#x8D25;&#x7684;&#x767B;&#x5F55;&#x5C1D;&#x8BD5;&#x4E4B;&#x540E;&#x5411;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x9A8C;&#x8BC1;&#x7801;&#xFF0C;&#x800C;&#x662F;&#x5141;&#x8BB8;&#x591A;&#x6B21;&#x5C1D;&#x8BD5;&#x3002;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5F3A;&#x884C;&#x4F7F;&#x7528;&#x5B89;&#x5168;&#x5BC6;&#x7801;&#x662F;&#x4E0D;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x6CC4;&#x6F0F;&#x7684;&#x51ED;&#x636E;&#x81EA;&#x52A8;&#x4E0E;&#x4F60;&#x7684;&#x670D;&#x52A1;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#xFF0C;&#x767B;&#x5F55;&#x540E;&#x5931;&#x8D25;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x751A;&#x81F3;&#x90FD;&#x4E0D;&#x4F1A;&#x8D77;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#x505C;&#x6B62;&#x5411;&#x8BD5;&#x56FE;&#x8BFB;&#x53D6;&#x5185;&#x5BB9;&#x7684;&#x7528;&#x6237;&#x663E;&#x793A;&#x9A8C;&#x8BC1;&#x7801;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x535A;&#x5BA2;&#x8981;&#x6C42;&#x6211;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x9A8C;&#x8BC1;&#x7801;&#x4EC5;&#x4EC5;&#x56E0;&#x4E3A;&#x6211;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x8D85;&#x7EA7;&#x53EF;&#x6015;&#x7684;VPN&#x4F5C;&#x4E3A;&#x4F60;&#x7684;CDN&#x7684;&#x201C;&#x9AD8;&#x7EA7;&#x519B;&#x4E8B;&#x7EA7;&#x673A;&#x5668;&#x4EBA;&#x4FDD;&#x62A4;&#x201D;&#x529F;&#x80FD;&#xFF0C;&#x6211;&#x5C06;&#x5173;&#x95ED;&#x6807;&#x7B7E;&#x3002;&#x6709;&#x65F6;&#xFF0C;&#x9A8C;&#x8BC1;&#x7801;&#x5BF9;&#x4E8E;&#x53EA;&#x8BFB;&#x64CD;&#x4F5C;&#x66F4;&#x5408;&#x7406;&#xFF0C;&#x6BD4;&#x5982;&#x505C;&#x6B62;&#x6D3B;&#x8DC3;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EA7;DDoS&#x653B;&#x51FB;&#x3002;&#x4F46;&#x662F;&#x4F60;&#x7684;&#x535A;&#x5BA2;&#x5E76;&#x4E0D;&#x662F;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#x3002;</p>
<p><strong>&#x4E0D;&#x9700;&#x8981;&#x91CD;&#x590D;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;</strong></p>
<p>&#x5982;&#x679C;&#x9A8C;&#x8BC1;&#x7801;&#x662F;&#x53EF;&#x80FD;&#x5931;&#x8D25;&#x9A8C;&#x8BC1;&#x5E76;&#x5728;&#x5931;&#x8D25;&#x65F6;&#x91CD;&#x65B0;&#x52A0;&#x8F7D;&#x7684;&#x7A97;&#x4F53;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5219;&#x5982;&#x679C;&#x7528;&#x6237;&#x6B63;&#x786E;&#x5730;&#x89E3;&#x51B3;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x9A8C;&#x8BC1;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x4E0D;&#x8981;&#x5F3A;&#x8FEB;&#x7528;&#x6237;&#x89E3;&#x51B3;&#x53E6;&#x4E00;&#x4E2A;&#x9A8C;&#x8BC1;&#x7801;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x5C31;&#x907F;&#x514D;&#x4E86;&#x7528;&#x6237;&#x5728;&#x4FEE;&#x6539;&#x8F93;&#x5165;&#x65F6;&#x4E0D;&#x5F97;&#x4E0D;&#x8FDE;&#x7EED;&#x51E0;&#x6B21;&#x6C42;&#x89E3;&#x9A8C;&#x8BC1;&#x7801;(&#x4F8B;&#x5982;&#xFF0C;&#x575A;&#x6301;&#x4F60;&#x7684;&#x9769;&#x547D;&#x6027;&#x5BC6;&#x7801;&#x7B56;&#x7565;&#xFF0C;&#x8BE5;&#x7B56;&#x7565;&#x81F3;&#x5C11;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x4E0D;&#x53EF;&#x6253;&#x5370;&#x5B57;&#x7B26;&#x3001;&#x4E00;&#x4E2A;&#x57C3;&#x53CA;&#x8C61;&#x5F62;&#x6587;&#x5B57;&#x548C;&#x4E00;&#x4E2A;&#x4EC5;&#x9650;iOS&#x7684;&#x8868;&#x60C5;&#x7B26;&#x53F7;)&#x3002;</p>
<p><strong>&#x660E;&#x667A;&#x5730;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x9A8C;&#x8BC1;&#x6765;&#x6E90;</strong></p>
<p>&#x8003;&#x8651;&#x4E00;&#x4E0B;&#xFF0C;&#x4F60;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x5408;&#x7406;&#x5730;&#x9A8C;&#x8BC1;&#x4E86;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x5728;&#x4EE5;&#x524D;&#x4E0E;&#x4ED6;&#x4EEC;&#x7684;&#x4EA4;&#x4E92;&#x4E2D;&#x5F88;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x6709;&#x4E00;&#x4E2A;&#x786E;&#x5B9A;&#x7684;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5730;&#x5740;&#x548C;&#x7535;&#x8BDD;&#x53F7;&#x7801;&#x6216;&#x6B63;&#x786E;&#x7684;&#x53CC;&#x56E0;&#x7D20;&#x8BA4;&#x8BC1;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x7ED9;&#x4ED6;&#x4EEC;&#x4E00;&#x4E2A;&#x9A8C;&#x8BC1;&#x7801;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x4ED8;&#x8D39;&#x5BA2;&#x6237;&#x51E0;&#x4E2A;&#x6708;&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x4E14;&#x8BD5;&#x56FE;&#x7528;&#x4ED6;&#x4EEC;&#x73B0;&#x6709;&#x7684;&#x8D26;&#x5355;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x65B0;&#x7684;&#x8D2D;&#x4E70;&#xFF0C;&#x90A3;&#x4E48;&#x73B0;&#x5728;&#x4E5F;&#x4E0D;&#x662F;&#x8BA9;&#x4ED6;&#x4EEC;&#x586B;&#x5199;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x65F6;&#x5019;&#x3002;&#x6211;&#x63D0;&#x5230;&#x8FD9;&#x4E2A;&#x53EA;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EE5;&#x524D;&#x5FC5;&#x987B;&#x8FD9;&#x6837;&#x505A;&#x3002;</p>
<h3 id="&#x672A;&#x6765;&#x7684;&#x9A8C;&#x8BC1;&#x65B9;&#x5F0F;">&#x672A;&#x6765;&#x7684;&#x9A8C;&#x8BC1;&#x65B9;&#x5F0F;</h3>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;<strong>&#x4E00;&#x4E2A;&#x8D44;&#x6E90;&#x5145;&#x8DB3;&#x7684;&#x653B;&#x51FB;&#x8005;&#x53EF;&#x4EE5;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x7ED5;&#x8FC7;&#x4EFB;&#x4F55;&#x4F60;&#x73B0;&#x6709;&#x7684;&#x673A;&#x5236;</strong>&#x3002;&#x5F53;&#x4E00;&#x9879;&#x670D;&#x52A1;&#x62E5;&#x6709;10&#x4EBF;&#x7528;&#x6237;(facebook&#x548C;twitter)&#x6216;&#x5176;&#x4ED6;&#x539F;&#x56E0;&#x800C;&#x5BFC;&#x81F4;&#x6EE5;&#x7528;(&#x4EFB;&#x4F55;&#x4E0E;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x6709;&#x5173;&#x7684;&#x5185;&#x5BB9;)&#x65F6;&#xFF0C;&#x5728;&#x8BD5;&#x56FE;&#x9A8C;&#x8BC1;&#x7528;&#x6237;&#x65F6;&#x5FC5;&#x987B;&#x505A;&#x51FA;&#x8270;&#x96BE;&#x7684;&#x6743;&#x8861;&#x3002;</p>
<p>&#x9762;&#x5BF9;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x4E00;&#x4E9B;&#x89C4;&#x6A21;&#x975E;&#x5E38;&#x5927;&#x7684;&#x670D;&#x52A1;&#x4E0D;&#x4EC5;&#x4F7F;&#x7528;reCAPTCHA&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x6267;&#x884C;&#x7535;&#x8BDD;&#x6216;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x9A8C;&#x8BC1;&#xFF0C;&#x5E76;&#x91C7;&#x7528;&#x5927;&#x91CF;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x81EA;&#x52A8;&#x68C0;&#x6D4B;&#x542F;&#x53D1;&#x5F0F;&#x65B9;&#x6CD5;&#x3002;Twitter&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x56E0;&#x4E3A;&#x65B0;&#x7528;&#x6237;&#x9700;&#x8981;&#x540C;&#x65F6;&#x5B8C;&#x6210;reCAPTCHA&#x5E76;(&#x901A;&#x5E38;)&#x9A8C;&#x8BC1;&#x4E00;&#x4E2A;&#x7535;&#x8BDD;&#x53F7;&#x7801;&#x3002;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;Twitter&#x7684;&#x6574;&#x4E2A;&#x56E2;&#x961F;&#x90FD;&#x81F4;&#x529B;&#x4E8E;&#x963B;&#x6B62;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x7684;&#x6EE5;&#x7528;&#xFF0C;&#x7136;&#x800C;&#x8FD9;&#x4E2A;&#x5E73;&#x53F0;&#x4ECD;&#x7136;&#x5B58;&#x5728;&#x7740;&#x6570;&#x767E;&#x4E07;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x50CF;Facebook&#x4E00;&#x6837;&#x3002;&#x867D;&#x7136;&#x8981;&#x6C42;&#x7535;&#x8BDD;&#x9A8C;&#x8BC1;&#x4F1A;&#x7ED9;&#x533F;&#x540D;&#x5E26;&#x6765;&#x4E0D;&#x5E78;&#x7684;&#x540E;&#x679C;&#xFF0C;&#x4F46;&#x5927;&#x591A;&#x6570;&#x5E73;&#x53F0;&#x4E00;&#x5F00;&#x59CB;&#x5E76;&#x4E0D;&#x6253;&#x7B97;&#x533F;&#x540D;&#x4F7F;&#x7528;&#x3002;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x6311;&#x6218;&#x662F;&#x5728;&#x9700;&#x8981;&#x7528;&#x6237;&#x533F;&#x540D;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x8BD5;&#x56FE;&#x963B;&#x6B62;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#xFF0C;&#x6211;&#x5728;&#x672C;&#x8282;&#x7684;&#x672B;&#x5C3E;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x4F8B;&#x5B50;&#x3002;</p>
<p>&#x968F;&#x7740;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x73B0;&#x72B6;&#xFF0C;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x53CB;&#x597D;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x56F0;&#x96BE;&#x3002;&#x5BF9;&#x9AD8;&#x7EA7;&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x4E00;&#x4E9B;&#x6700;<a href="https://uxplanet.org/accessibility-vs-security-breaking-captchas-by-exploiting-their-accessibility-features-d0c805839144" target="_blank">&#x6709;&#x6548;&#x7684;</a>&#x653B;&#x51FB;&#xFF0C;&#x5982;reCAPTCHA&#xFF0C;&#x53EA;&#x9700;&#x63A5;&#x53D7;&#x7ED9;&#x5B9A;&#x7684;&#x6311;&#x6218;&#x5E76;&#x67E5;&#x8BE2;&#x673A;&#x5668;&#x5B66;&#x4E60;API&#x6765;&#x81EA;&#x52A8;&#x89E3;&#x51B3;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6709;&#x4E86;<a href="https://cloud.google.com/products/ai/" target="_blank">&#x8BB8;&#x591A;</a><a href="https://aws.amazon.com/machine-learning/" target="_blank">API</a><a href="https://azure.microsoft.com/en-us/services/cognitive-services/" target="_blank">&#x670D;&#x52A1;</a>&#x6765;&#x51C6;&#x786E;&#x5730;&#x6807;&#x8BB0;&#x97F3;&#x9891;&#x3001;&#x56FE;&#x50CF;&#x3001;&#x89C6;&#x9891;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x53EA;&#x662F;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5F3A;&#x5927;&#xFF0C;&#x5C31;&#x50CF;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x4E0D;&#x53EF;&#x80FD;&#x6709;&#x5B8C;&#x7F8E;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#xFF0C;&#x6709;&#x4EBA;&#x5199;&#x4E86;&#x4E00;&#x4E9B;&#x6587;&#x7AE0;&#x8C34;&#x8D23;&#x9A8C;&#x8BC1;&#x7801;&#x5DF2;&#x7ECF;&#x6B7B;&#x4E86;<a href="https://blog.codinghorror.com/captcha-is-dead-long-live-captcha/" target="_blank">&#x5341;&#x591A;&#x5E74;</a>&#xFF0C;&#x56E0;&#x4E3A;&#x771F;&#x6B63;&#x7684;&#x8D1F;&#x9762;(&#x4F5C;&#x4E3A;&#x4EBA;&#x7C7B;&#x4F20;&#x9012;&#x7684;&#x8F6F;&#x4EF6;)&#x7684;&#x53EF;&#x80FD;&#x6027;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x4E92;&#x8054;&#x7F51;&#x5E76;&#x6CA1;&#x6709;&#x88AB;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x6DF9;&#x6CA1;&#x3002;&#x667A;&#x80FD;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#x5728;FAANG&#x5DE5;&#x4F5C;&#x8D5A;&#x66F4;&#x591A;&#x7684;&#x94B1;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7528;&#x672A;&#x7ECF;&#x8BF7;&#x6C42;&#x7684;&#x5047;&#x5E7F;&#x544A;&#x6765;&#x8986;&#x76D6;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x81F3;&#x5C11;&#x76EE;&#x524D;&#x662F;&#x8FD9;&#x6837;&#x3002;&#x5BF9;&#x4E8E;&#x7269;&#x7406;&#x5B89;&#x5168;&#x7684;&#x4E00;&#x4E2A;&#x6F5C;&#x5728;&#x7684;&#x9519;&#x8BEF;&#x7C7B;&#x6BD4;&#xFF0C;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x53EF;&#x4EE5;&#x6253;&#x7834;&#x95E8;&#x3001;&#x7A97;&#x3001;&#x76F8;&#x673A;&#x3001;&#x4F20;&#x611F;&#x5668;&#x3001;&#x9501;&#x7B49;&#x66F4;&#x591A;&#x7684;&#x7269;&#x7406;&#x7269;&#x54C1;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x4E9B;&#x4FDD;&#x62A4;&#x63AA;&#x65BD;&#x4ECD;&#x7136;&#x662F;&#x5B9E;&#x4F53;&#x5B89;&#x5168;&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x672C;&#x7279;&#x5F81;&#x3002;&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x4E0D;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x88AB;&#x7834;&#x574F;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x653B;&#x51FB;&#x8005;&#x7684;&#x5DE5;&#x4F5C;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x56F0;&#x96BE;&#xFF0C;&#x4F7F;&#x52AA;&#x529B;&#x548C;&#x56DE;&#x62A5;&#x6BD4;&#x7387;&#x8FBE;&#x5230;&#x8DB3;&#x4EE5;&#x963B;&#x6B62;&#x5927;&#x591A;&#x6570;&#x653B;&#x51FB;&#x8005;&#x7684;&#x7A0B;&#x5EA6;&#x3002;</p>
<p>&#x4E0D;&#x7BA1;&#x5373;&#x5C06;&#x5230;&#x6765;&#x7684;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x9738;&#x4E3B;&#x5730;&#x4F4D;&#xFF0C;&#x66F4;&#x5927;&#x7684;&#x7CFB;&#x7EDF;&#x503E;&#x5411;&#x4E8E;&#x652F;&#x6301;&#x7684;&#x5F53;&#x524D;&#x8DEF;&#x5F84;&#x5305;&#x62EC;&#x9A8C;&#x8BC1;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x7528;&#x6237;&#x662F;&#x8C01;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x8BD5;&#x56FE;&#x9A8C;&#x8BC1;&#x4ED6;&#x4EEC;&#x662F;&#x5426;&#x662F;&#x4EBA;&#x3002;&#x7535;&#x8BDD;&#x9A8C;&#x8BC1;&#xFF0C;&#x6709;&#x65F6;&#x751A;&#x81F3;&#x56FE;&#x7247;&#x3001;&#x8EAB;&#x4EFD;&#x8BC1;&#x6216;&#x5730;&#x5740;&#x9A8C;&#x8BC1;&#xFF0C;&#x90FD;&#x662F;&#x5728;&#x6709;&#x5F88;&#x5927;&#x53EF;&#x80FD;&#x88AB;&#x6EE5;&#x7528;&#x7684;&#x5927;&#x578B;&#x670D;&#x52A1;&#x4E2D;&#x53D1;&#x73B0;&#x7684;&#xFF0C;&#x4EE5;&#x53CA;&#x6211;&#x4EEC;&#x597D;&#x670B;&#x53CB;&#x7684;reCAPTCHA&#x3002;&#x5728;&#x5C1D;&#x8BD5;&#x66F4;&#x597D;&#x5730;&#x4FDD;&#x6301;&#x533F;&#x540D;&#x6027;&#x7684;&#x540C;&#x65F6;&#x9A8C;&#x8BC1;&#x7528;&#x6237;&#x662F;&#x6BD4;&#x8F83;&#x56F0;&#x96BE;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x90A3;&#x4E9B;&#x88AB;&#x786E;&#x5B9A;&#x7684;&#x7528;&#x6237;&#x901A;&#x5E38;&#x4F1A;&#x627E;&#x5230;&#x806A;&#x660E;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x4E00;&#x4E9B;&#x5F88;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#x5305;&#x62EC;<a href="https://privacypass.github.io/" target="_blank">&#x9690;&#x79C1;&#x901A;&#x884C;&#x8BC1;</a>(<a href="https://www.petsymposium.org/2018/files/papers/issue3/popets-2018-0026.pdf" target="_blank">&#x534F;&#x8BAE;&#x6587;&#x4EF6;</a>)&#xFF0C;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x533F;&#x540D;&#x8DF3;&#x8FC7;&#x5BC6;&#x7801;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x5DF2;&#x7ECF;&#x89E3;&#x51B3;&#x4E86;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x82F9;&#x679C;&#x7684;&#x65B0;&#x7684;<a href="https://www.wired.com/story/apple-find-my-cryptography-bluetooth/" target="_blank">&#x67E5;&#x627E;&#x6211;&#x7684;&#x8BBE;&#x5907;</a>&#x529F;&#x80FD;&#xFF0C;&#x5141;&#x8BB8;&#x82F9;&#x679C;&#x8BBE;&#x5907;&#x7528;<a href="https://en.wikipedia.org/wiki/Bluetooth_Low_Energy" target="_blank">BLE</a>&#x5E7F;&#x64AD;&#x4ED6;&#x4EEC;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x8FD9;&#x6837;&#x5B83;&#x53EA;&#x80FD;&#x88AB;&#x539F;&#x59CB;&#x8BBE;&#x5907;&#x7684;&#x6240;&#x6709;&#x8005;&#x8BFB;&#x53D6;&#xFF0C;&#x4EE5;&#x53CA;&#x4F17;&#x6240;&#x5468;&#x77E5;&#x7684;&#x5B89;&#x5168;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F8B;&#x5982;<a href="https://en.wikipedia.org/wiki/Public-key_cryptography" target="_blank">&#x975E;&#x5BF9;&#x79F0;&#x5BC6;&#x7801;</a>&#xFF0C;<a href="https://en.wikipedia.org/wiki/Cryptographic_hash_function" target="_blank">&#x5BC6;&#x7801;&#x6563;&#x5217;</a>&#xFF0C;<a href="https://en.wikipedia.org/wiki/Differential_privacy" target="_blank">&#x5DEE;&#x522B;&#x5316;&#x9690;&#x79C1;</a><a href="https://en.wikipedia.org/wiki/Shamir%27s_Secret_Sharing" target="_blank">&#x7B49;&#x7B49;</a>&#xFF0C;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x5DE7;&#x5999;&#x5730;&#x5B9E;&#x73B0;&#xFF0C;&#x4EE5;&#x63D0;&#x9AD8;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x5E76;&#x4E14;&#x5E38;&#x5E38;&#x662F;&#x533F;&#x540D;&#x7684;&#x3002;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5E2E;&#x52A9;&#x9A8C;&#x8BC1;&#x7528;&#x6237;&#x548C;&#x51CF;&#x5C11;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x7684;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#x5305;&#x62EC;<a href="https://en.wikipedia.org/wiki/Proof_of_work" target="_blank">&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;</a>&#x548C;<a href="https://en.wikipedia.org/wiki/Micropayment" target="_blank">&#x5C0F;&#x989D;&#x652F;&#x4ED8;</a>&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x6280;&#x672F;&#x5728;&#x5927;&#x591A;&#x6570;&#x6D41;&#x884C;&#x7684;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;(&#x5982;&#x6BD4;&#x7279;&#x5E01;&#x548C;&#x7535;&#x5B50;&#x8D27;&#x5E01;)&#x4E2D;&#x5DF2;&#x7ECF;&#x6210;&#x529F;&#x5730;&#x4F7F;&#x7528;&#x4E86;&#x5341;&#x591A;&#x5E74;&#xFF0C;&#x5C3D;&#x7BA1;&#x5728;&#x65E5;&#x5E38;&#x573A;&#x666F;&#x4E2D;&#x4ECD;&#x7136;&#x5F88;&#x96BE;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x662F;Twitter&#x6216;Facebook&#xFF0C;&#x5219;&#x4EFB;&#x4F55;&#x9A8C;&#x8BC1;&#x7801;&#x90FD;&#x4E0D;&#x4F1A;&#x89E3;&#x51B3;&#x4F60;&#x7684;&#x6240;&#x6709;&#x95EE;&#x9898;&#x3002;&#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x6BCF;&#x4E2A;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x4ECD;&#x7136;&#x6709;&#x5F88;&#x591A;&#x7B80;&#x5355;&#x7684;&#x5DE5;&#x5177;&#x548C;&#x542F;&#x53D1;&#x65B9;&#x5F0F;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x5E2E;&#x52A9;&#x963B;&#x6B62;&#x6EE5;&#x7528;&#x65B9;&#x9762;&#x53D6;&#x5F97;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x5BF9;&#x4F60;&#x7684;&#x7528;&#x6237;&#x8868;&#x73B0;&#x5F88;&#x597D;&#xFF0C;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x5F3A;&#x8FEB;&#x4ED6;&#x4EEC;&#x82B1;&#x65F6;&#x95F4;&#x5B8C;&#x6210;&#x8C37;&#x6B4C;&#x7684;ReCAPTCHA&#x3002;&#x4ED6;&#x4EEC;&#x4F1A;&#x66F4;&#x9752;&#x7750;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x559C;&#x6B22;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x6216;&#x8005;&#x6307;&#x51FA;&#x4E0D;&#x8DB3;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;<a href="https://twitter.com/Nearcyan" target="_blank">Twitter</a>&#x4E0A;&#x548C;&#x6211;&#x6253;&#x4E2A;&#x62DB;&#x547C;&#x3002;</p>
<blockquote>
<p>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x53D1;&#x5E03;&#x5728;<a href="https://kevv.net/category/software/" target="_blank">&#x8F6F;&#x4EF6;</a>&#x548C;<a href="https://kevv.net/category/webdev/" target="_blank">WebDev</a>&#xFF0C;&#x6807;&#x7B7E;&#x6709;&#xFF1A;<a href="https://kevv.net/tag/captcha/" target="_blank">CAPTCHA</a>&#x3001;<a href="https://kevv.net/tag/google/" target="_blank">Google</a>&#x3001;<a href="https://kevv.net/tag/recaptcha/" target="_blank">reCAPTCHA</a>&#x3001;<a href="https://kevv.net/tag/security/" target="_blank">&#x5B89;&#x5168;&#x6027;</a>&#x3001;<a href="https://kevv.net/tag/spam/" target="_blank">&#x5783;&#x573E;&#x90AE;&#x4EF6;</a>&#x3001;<a href="https://kevv.net/tag/ui/" target="_blank">UI</a>&#x548C;<a href="https://kevv.net/tag/ux/" target="_blank">UX</a>&#x3002;</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../how-to-convince-your-team-to-adopt-grid/ch.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 如何说服你的团队采用CSS Grid">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"你可能不需要ReCAPTCHA","level":"2.1","depth":1,"previous":{"title":"如何说服你的团队采用CSS Grid","level":"1.2","depth":1,"path":"other/how-to-convince-your-team-to-adopt-grid/ch.md","ref":"other/how-to-convince-your-team-to-adopt-grid/ch.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"other/you-probably-dont-need-recaptcha/ch.md","mtime":"2019-06-23T11:27:33.386Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-06-23T11:28:30.593Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

