
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>如何说服你的团队采用CSS Grid · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../color/ch.html" />
    
    
    <link rel="prev" href="../../" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    杂物空间·翻译
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="ch.html">
            
                <a href="ch.html">
            
                    
                    如何说服你的团队采用CSS Grid
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../color/ch.html">
            
                <a href="../color/ch.html">
            
                    
                    颜色：从十六进制编码到眼球
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >如何说服你的团队采用CSS Grid</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5982;&#x4F55;&#x8BF4;&#x670D;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x91C7;&#x7528;css-grid"><a href="https://css-irl.info/how-to-convince-your-team-to-adopt-grid/" target="_blank">&#x5982;&#x4F55;&#x8BF4;&#x670D;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x91C7;&#x7528;CSS Grid</a></h1>
<p><img src="https://css-irl.info/how-to-convince-your-team-2b6332cbb969c7150425ca2858420ec4.svg" alt="Performance"></p>
<p><b>&#x4F5C;&#x8005;&#xFF1A;<a href="https://twitter.com/CSSInRealLife" target="_blank">CSSInRealLife</a>@&#x521B;&#x4F5C;&#x65F6;&#x95F4;&#xFF1A;2019-03-09   <a href="https://css-irl.info/how-to-convince-your-team-to-adopt-grid/" target="_blank">&#x539F;&#x6587;&#x5730;&#x5740;</a></b></p>
<p><em>&#x7FFB;&#x8BD1;&amp;&#x6821;&#x9A8C;&#xFF1A;<a href="https://github.com/yylifen" target="_blank">freedom</a></em></p>
<p>&#x4F60;&#x662F;&#x4E0D;&#x662F;&#x60F3;&#x4F7F;&#x7528;CSS Grid&#x5E03;&#x5C40;&#x4F46;&#x53C8;&#x96BE;&#x4EE5;&#x8BF4;&#x670D;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x5176;&#x4ED6;&#x6210;&#x5458;&#xFF08;&#x4F60;&#x7684;&#x540C;&#x4E8B;&#x6216;&#x8005;&#x4F60;&#x7684;&#x9886;&#x5BFC;&#xFF09;&#xFF1F; &#x6700;&#x8FD1;&#x6709;&#x4EBA;&#x95EE;&#x6211;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x5EFA;&#x8BAE;&#x53EF;&#x4EE5;&#x8BF4;&#x670D;&#x5BF9;CSS Grid&#x6301;&#x6709;&#x6000;&#x7591;&#x6001;&#x5EA6;&#x7684;&#x56E2;&#x961F;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x4E2D;&#x91C7;&#x7528;CSS Grid&#x3002; &#x867D;&#x7136;&#x6211;&#x81EA;&#x5DF1;&#x5728;&#x8FD9;&#x65B9;&#x9762;&#x6CA1;&#x6709;&#x9047;&#x5230;&#x4EFB;&#x4F55;&#x91CD;&#x5927;&#x969C;&#x788D;&#xFF0C; &#x4F46;&#x6211;&#x7ECF;&#x5E38;&#x542C;&#x5230;&#x4E00;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x6545;&#x4E8B;&#x3002; &#x4F60;&#x5DF2;&#x7ECF;&#x51C6;&#x5907;&#x597D;&#x6F5C;&#x5165;&#x5E76;&#x4F7F;&#x7528;&#x6700;&#x65B0;&#x7684;&#x73B0;&#x4EE3;&#x5E03;&#x5C40;&#x6280;&#x672F;&#xFF0C;&#x5374;&#x53EA;&#x6709;&#x5177;&#x5907;&#x66F4;&#x9AD8;&#x7684;&#x6743;&#x5229;&#x624D;&#x80FD;&#x63A8;&#x52A8;&#x3002;  </p>
<p>&#x5C3D;&#x7BA1;&#x6709;&#x70B9;&#x4EE4;&#x4EBA;&#x6CAE;&#x4E27;&#xFF0C;&#x4F46;&#x662F;&#x5B58;&#x5728;&#x5373;&#x662F;&#x5408;&#x7406;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x6253;&#x7834;&#x5B83;&#x5427;&#xFF01;</p>
<p>&#x4F5C;&#x4E3A;&#x65C1;&#x6CE8;&#xFF0C;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x6765;&#x81EA;&#x6211;&#x5728;&#x7F51;&#x7EDC;&#x4EE3;&#x7406;&#x5546;&#x7684;&#x7ECF;&#x9A8C;&#x3002; &#x6211;&#x5E76;&#x4E0D;&#x662F;&#x58F0;&#x79F0;&#x8981;&#x5206;&#x4EAB;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x56E0;&#x4E3A;&#x5176;&#x4ED6;&#x73AF;&#x5883;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x91C7;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x3002; &#x4F46;&#x662F;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E9B;&#x666E;&#x904D;&#x800C;&#x4E14;&#x6709;&#x6548;&#x7684;&#x5EFA;&#x8BAE;&#x3002;</p>
<h3 id="&#x4ED6;&#x4EEC;&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x8BF4;&#x670D;&#x529B;&#xFF1F;">&#x4ED6;&#x4EEC;&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x8BF4;&#x670D;&#x529B;&#xFF1F;</h3>
<p><strong>&#x6D4F;&#x89C8;&#x5668;&#x652F;&#x6301;</strong></p>
<p>&#x4E0D;&#x91C7;&#x7528;Grid&#x7684;&#x6700;&#x5E38;&#x89C1;&#x539F;&#x56E0;&#x662F;&#x6D4F;&#x89C8;&#x5668;&#x652F;&#x6301;&#x3002; &#x867D;&#x7136;Grid<a href="https://caniuse.com/#search=css%20grid" target="_blank">&#x5728;&#x5168;&#x7403;&#x8303;&#x56F4;&#x5185;&#x62E5;&#x6709;&#x5927;&#x7EA6;85&#xFF05;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x652F;&#x6301;</a>&#xFF0C;&#x4F46;&#x5176;&#x4ED6;15&#xFF05;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x5DF2;&#x7ECF;&#x505C;&#x6B62;&#x652F;&#x6301;&#x3002; &#x8FD9;&#x4E9B;&#x7528;&#x6237;&#x4E2D;&#x6709;&#x5F88;&#x5927;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x5728;IE&#x4E0A;&#xFF0C;&#x4ECE;IE10&#x5F00;&#x59CB;&#xFF0C;&#x5B83;&#x5B9E;&#x9645;&#x4E0A;&#x652F;&#x6301;CSS Grid&#x7684;&#x65E7;&#x8BED;&#x6CD5;&#x3002; &#xFF08;&#x6211;&#x5C06;&#x4FDD;&#x7559;&#x4F60;&#x662F;&#x5426;&#x60F3;&#x5728;&#x67D0;&#x5929;&#x60F3;&#x652F;&#x6301;&#x65E7;&#x8BED;&#x6CD5;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x6CBF;&#x7740;&#x8FD9;&#x6761;&#x8DEF;&#x8D70;&#x4E0B;&#x53BB;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x7BC7;<a href="https://css-tricks.com/css-grid-in-ie-css-grid-and-the-new-autoprefixer/" target="_blank">&#x597D;&#x6587;&#x7AE0;</a>&#x3002;&#xFF09;&#x8FD9;&#x4E9B;&#x7528;&#x6237;&#x9700;&#x8981;&#x7684;&#x5E03;&#x5C40;&#x81F3;&#x5C11;&#x662F;&#x53EF;&#x7528;&#x3002; &#x8FD9;&#x8BA9;&#x6211;&#x60F3;&#x5230;&#x4E86;&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;......</p>
<p><strong>&#x65F6;&#x95F4;&#x6210;&#x672C;</strong></p>
<p>&#x5982;&#x679C;&#x5E76;&#x975E;&#x6240;&#x6709;&#x6D4F;&#x89C8;&#x5668;&#x90FD;&#x652F;&#x6301;CSS&#x5C5E;&#x6027;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x5408;&#x7406;&#x7684;&#x56DE;&#x9000;&#x3002; &#x5728;&#x5355;&#x72EC;&#x4F7F;&#x7528;&#x5355;&#x4E2A;&#x5C5E;&#x6027;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF08;&#x4F8B;&#x5982;&#x6DF7;&#x5408;&#x6A21;&#x5F0F;&#xFF09;&#xFF0C;&#x7F16;&#x5199;&#x989D;&#x5916;&#x7684;&#x4E00;&#x884C;&#x6216;&#x4E24;&#x884C;&#x53EF;&#x80FD;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#xFF0C;&#x4F7F;&#x7528;&#x6237;&#x80FD;&#x591F;&#x4EE5;&#x6709;&#x7528;&#xFF08;&#x6216;&#x8005;&#x6B21;&#x4F18;&#xFF09;&#x7684;&#x65B9;&#x5F0F;&#x4F53;&#x9A8C;&#x4F60;&#x7684;&#x5185;&#x5BB9;&#x3002; &#x8FD9;&#x662F;<a href="https://developer.mozilla.org/en-US/docs/Glossary/Progressive_Enhancement" target="_blank">&#x6E10;&#x8FDB;&#x5F0F;&#x589E;&#x5F3A;</a>&#x3002;  </p>
<p>&#x4F7F;&#x7528;&#x50CF;Grid&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x89C4;&#x8303;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5C06;&#x5176;&#x4F5C;&#x4E3A;&#x4E3B;&#x8981;&#x5E03;&#x5C40;&#x7B56;&#x7565;&#xFF0C;&#x5B83;&#x5C06;&#x4E0D;&#x4EC5;&#x5F71;&#x54CD;&#x4E00;&#x4E2A;&#x6216;&#x4E24;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x800C;&#x4E14;&#x5F71;&#x54CD;&#x6574;&#x4E2A;&#x7F51;&#x9875;&#x3002; &#x6240;&#x4EE5;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7565;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x6545;&#x4E8B;&#x3002; &#x4F60;&#x9700;&#x8981;&#x786E;&#x4FDD;&#x63D0;&#x4F9B;&#x5408;&#x7406;&#x7684;&#x56DE;&#x9000;&#xFF0C;&#x65E0;&#x8BBA;&#x4F60;&#x4F7F;&#x7528;&#x54EA;&#x79CD;&#x7B56;&#x7565;&#x6765;&#x652F;&#x6301;&#x65E7;&#x7248;&#x6D4F;&#x89C8;&#x5668;&#x3002; &#x6211;&#x4E0D;&#x4F1A;&#x5426;&#x8BA4;&#x6709;&#x65F6;&#x8FD9;&#x9700;&#x8981;&#x4E00;&#x70B9;&#x65F6;&#x95F4;&#x3002;  </p>
<p>&#x5982;&#x679C;&#x4F60;&#x56E2;&#x961F;&#x7684;&#x5176;&#x4ED6;&#x6210;&#x5458;&#x8FD8;&#x4E0D;&#x719F;&#x6089;Grid&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x8BA9;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x719F;&#x6089;&#x65B0;&#x7684;&#x5E03;&#x5C40;&#x7B56;&#x7565;&#x65F6;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x8003;&#x8651;&#x65F6;&#x95F4;&#x56E0;&#x7D20;&#x3002; &#x9700;&#x8981;&#x8BA9;&#x5927;&#x5BB6;&#x79BB;&#x5F00;&#x73B0;&#x6709;&#x9879;&#x76EE;&#x4E00;&#x5929;&#x5DE6;&#x53F3;&#x6295;&#x8D44;&#x8FD9;&#x9879;&#x57F9;&#x8BAD;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x611F;&#x5230;&#x7D27;&#x5F20;&#x3002;</p>
<p><strong>&#x53EF;&#x7EF4;&#x62A4;&#x6027;</strong></p>
<p>&#x6709;&#x4E9B;&#x56E2;&#x961F;&#x53EF;&#x80FD;&#x4F1A;&#x62C5;&#x5FC3;&#xFF0C;&#x5F53;&#x56E2;&#x961F;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x4EBA;&#x62FF;&#x8D77;&#x4F60;&#x7684;&#x9879;&#x76EE;&#x8FDB;&#x884C;&#x5DE5;&#x4F5C;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#x7EF4;&#x62A4;&#x8D77;&#x6765;&#x6BD4;&#x8F83;&#x56F0;&#x96BE;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x4ED6;&#x4EEC;&#x4E0D;&#x719F;&#x6089;&#x7684;CSS&#xFF0C;&#x800C;&#x4E0D;&#x662F;X&#x6846;&#x67B6;&#x3002; &#x4E0E;&#x6B64;&#x76F8;&#x5173;&#xFF0C;&#x4F7F;&#x7528;Grid&#x6784;&#x5EFA;&#x5E03;&#x5C40;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4EBA;&#x4F7F;&#x7528;&#x7F51;&#x683C;&#x7EBF;&#x547D;&#x540D;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x4EBA;&#x4F7F;&#x7528;<code>grid-template-areas</code>&#x547D;&#x540D;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x76F8;&#x5F53;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x4EE3;&#x7801;&#x5E93;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x63A5;&#x624B;&#x8BE5;&#x9879;&#x76EE;&#x7684;&#x4EBA;&#x611F;&#x5230;&#x5934;&#x75DB;&#x3002;</p>
<p>&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x539F;&#x56E0;&#x5F52;&#x7ED3;&#x4E3A;&#x65F6;&#x95F4;&#x548C;&#x91D1;&#x94B1;&#x7684;&#x6210;&#x672C;&#x3002; &#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x7684;&#x662F;&#x8BA9;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x76F8;&#x4FE1;Grid&#x53EF;&#x4EE5;&#x4E3A;&#x4E24;&#x8005;&#x63D0;&#x4F9B;&#x5E2E;&#x52A9;&#x3002;</p>
<h3 id="grid&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF1F;">Grid&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF1F;</h3>
<p>&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#x4F7F;&#x7528;Grid&#x5982;&#x4F55;&#x5E2E;&#x52A9;&#x89E3;&#x51B3;&#x4E0A;&#x8FF0;&#x95EE;&#x9898;&#xFF0C;&#x751A;&#x81F3;&#x89E3;&#x51B3;&#x66F4;&#x591A;&#x7684;&#x5176;&#x4ED6;&#x95EE;&#x9898;&#xFF1A;</p>
<p><strong>&#x590D;&#x6742;&#x5E03;&#x5C40;&#x53EF;&#x4EE5;&#x8282;&#x7701;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;</strong></p>
<p>Grid&#x6781;&#x5927;&#x5730;&#x7B80;&#x5316;&#x4E86;&#x4EE5;&#x524D;&#x5E03;&#x5C40;&#x9700;&#x8981;&#x5927;&#x91CF;<a href="https://en.wikipedia.org/wiki/CSS_hack" target="_blank">hack</a>&#x548C;<a href="https://en.wikipedia.org/wiki/Polyfill_(programming" target="_blank">polyfill</a>)&#x7684;&#x8FC7;&#x7A0B;&#x3002; &#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x8F83;&#x65E7;&#x7684;&#x5E03;&#x5C40;&#x65B9;&#x6CD5;&#x7834;&#x89E3;&#x590D;&#x6742;&#x8BBE;&#x8BA1;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5C06;&#x6D6A;&#x8D39;&#x5B9D;&#x8D35;&#x7684;&#x65F6;&#x95F4;&#x3002; &#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x8FD8;&#x9700;&#x8981;&#x4E3A;&#x65E7;&#x7248;&#x6D4F;&#x89C8;&#x5668;&#x63D0;&#x4F9B;&#x53EF;&#x7528;&#x7684;&#x540E;&#x5907;&#x65B9;&#x6848;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x4E0D;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x3002;  </p>
<p>&#x5982;&#x679C;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x4F7F;&#x7528;&#x8F83;&#x65E7;&#x7684;&#x5E03;&#x5C40;&#x6280;&#x672F;&#x7F16;&#x5199;&#x81EA;&#x5DF1;&#x7684;&#x7F51;&#x683C;&#x6846;&#x67B6;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E00;&#x5207;&#x4E5F;&#x9700;&#x8981;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x3002;  </p>
<p><strong>&#x62E5;&#x62B1;&#x521B;&#x9020;&#x529B;</strong></p>
<p>&#x5982;&#x679C;&#x8BBE;&#x8BA1;&#x5E08;&#x3001;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x548C;&#x56E2;&#x961F;&#x60F3;&#x8981;&#x7A81;&#x7834;&#x754C;&#x9650;&#x5E76;&#x6784;&#x5EFA;&#x771F;&#x6B63;&#x5BCC;&#x6709;&#x521B;&#x610F;&#x7684;&#x73B0;&#x4EE3;&#x5E03;&#x5C40;&#xFF0C;&#x4ECE;&#x4EBA;&#x7FA4;&#x4E2D;&#x4E2D;&#x8131;&#x9896;&#x800C;&#x51FA;&#x5E76;&#x62E5;&#x62B1;<a href="https://www.zeldman.com/2018/05/02/transcript-intrinsic-web-design-with-jen-simmons-the-big-web-show/" target="_blank">&#x7F51;&#x9875;&#x8BBE;&#x8BA1;&#x601D;&#x7EF4;&#x7684;&#x65B0;&#x65F6;&#x4EE3;</a>&#xFF0C;&#x90A3;&#x4E48;Grid&#x5C31;&#x662F;&#x5176;&#x4E2D;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002; Grid&#x4F7F;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x6784;&#x5EFA;&#x4EE5;&#x524D;&#x7528;CSS&#x65E0;&#x6CD5;&#x5B9E;&#x73B0;&#x7684;&#x5E03;&#x5C40;&#x3002;  </p>
<p><strong>&#x6027;&#x80FD;&#x66F4;&#x597D;</strong></p>
<p>&#x8BB8;&#x591A;&#x9879;&#x76EE;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x5BFC;&#x5165;&#x4E86;&#x5927;&#x578B;&#xFF0C;&#x7B28;&#x91CD;&#x7684;CSS&#x6846;&#x67B6;&#x3002;&#x5373;&#x4F7F;&#x662F;&#x6700;&#x5C0F;&#x7684;&#x7C7B;&#x4E5F;&#x53EF;&#x80FD;&#x6700;&#x7EC8;&#x6DFB;&#x52A0;&#x4E86;&#x8BB8;&#x591A;&#x989D;&#x5916;&#x7684;&#x7C7B;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x4F1A;&#x589E;&#x52A0;CSS&#x6587;&#x4EF6;&#x7684;&#x91CD;&#x91CF;&#x3002; &#x5BF9;&#x4E8E;&#x4E0E;&#x201C;&#x6807;&#x51C6;&#x201D;&#x5217;&#x548C;&#x884C;&#x4E0D;&#x540C;&#x7684;&#x590D;&#x6742;&#x5E03;&#x5C40;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x6C42;&#x52A9;Javascript&#x5E93;&#x3002; &#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x51E0;&#x4E4E;&#x80AF;&#x5B9A;&#x5728;2019&#x5E74;&#x5DF2;&#x7ECF;&#x4E0D;&#x9700;&#x8981;&#x501F;&#x52A9;&#x989D;&#x5916;&#x7684;JS&#x6765;&#x5904;&#x7406;&#x5E03;&#x5C40;&#xFF08;&#x9664;&#x4E86;&#x6781;&#x5C11;&#x6570;&#x4F8B;&#x5916;&#xFF09;&#x3002; CSS Grid&#x53EF;&#x4EE5;&#x7528;&#x5F88;&#x5C11;&#x7684;&#x4EE3;&#x7801;&#x5904;&#x7406;&#x8BB8;&#x591A;&#x590D;&#x6742;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x8FF9;&#x8C61;&#x8868;&#x660E;&#xFF0C;<a href="https://blogs.igalia.com/jfernandez/2015/06/24/performance-on-grid-layout/" target="_blank">&#x4F7F;&#x7528;flexbox&#x521B;&#x5EFA;&#x7F51;&#x683C;&#x8BBE;&#x8BA1;</a>&#x7684;&#x6027;&#x80FD;&#x8F83;&#x5DEE; - &#x5C3D;&#x7BA1;&#x6211;&#x65E0;&#x6CD5;&#x5728;&#x76F8;&#x540C;&#x7EA7;&#x522B;&#x7684;&#x7EC6;&#x8282;&#x4E0A;&#x627E;&#x5230;&#x66F4;&#x591A;&#x8D44;&#x6E90;&#x3002;  </p>
<p><strong>&#x66F4;&#x65B9;&#x4FBF;&#x7EF4;&#x62A4;</strong></p>
<p>&#x56E0;&#x4E3A;Grid&#x53EA;&#x662F;&#x539F;&#x751F;CSS&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4E0D;&#x4F1A;&#x6709;&#x88AB;&#x7834;&#x574F;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x5FC5;&#x987B;&#x5728;&#x4E00;&#x5E74;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x91CD;&#x6784;&#x9879;&#x76EE;&#x7684;&#x98CE;&#x9669;&#x3002; &#x5B83;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x7A33;&#x5B9A;&#x7684;&#x3002; &#x6D4F;&#x89C8;&#x5668;&#x652F;&#x6301;&#x53EA;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x5F3A;&#x5927;&#x3002; &#x76F8;&#x53CD;&#xFF0C;&#x4F9D;&#x8D56;&#x6846;&#x67B6;&#x6216;&#x8005;&#x5E93;&#x4F1A;&#x7834;&#x574F;&#x9879;&#x76EE;&#x3002; &#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x7EF4;&#x62A4;&#x3002; &#x4F60;&#x53EF;&#x80FD;&#x5FC5;&#x987B;&#x5728;&#x4E00;&#x4E24;&#x5E74;&#x5185;&#x91CD;&#x65B0;&#x8BBF;&#x95EE;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x4F46;&#x5374;&#x53D1;&#x73B0;&#x5B83;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x4E0D;&#x518D;&#x4E3B;&#x52A8;&#x7EF4;&#x62A4;&#x7684;&#x65E7;&#x7F51;&#x683C;&#x6846;&#x67B6;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x7248;&#x672C;&#x5DF2;&#x8FC7;&#x65F6;&#x800C;&#x4F60;&#x65E0;&#x6CD5;&#x627E;&#x5230;&#x6587;&#x6863;&#x3002; &#x4F17;&#x6240;&#x5468;&#x77E5;&#x7684;&#x50CF;Bootstrap&#x8FD9;&#x6837;&#x7684;&#x6846;&#x67B6;&#x53EF;&#x80FD;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4F1A;&#x5E26;&#x6765;&#x6027;&#x80FD;&#x6743;&#x8861;&#x3002;  </p>
<p>&#x540C;&#x6837;&#xFF0C;&#x6295;&#x8D44;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x5B66;&#x4E60;&#x7F51;&#x683C;&#x662F;&#x5BF9;&#x672A;&#x6765;&#x7684;&#x5B89;&#x5168;&#x6295;&#x8D44;&#x3002; &#x5B83;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5728;&#x51E0;&#x5E74;&#x5185;&#x5C31;&#x4F1A;&#x8FC7;&#x65F6;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x5B83;&#x7684;CSS&#x57FA;&#x7840;&#x4ECD;&#x7136;&#x5B58;&#x5728;&#x3002; &#x8FD9;&#x4E9B;&#x6280;&#x80FD;&#x5C06;&#x5728;&#x672A;&#x6765;&#x8BB8;&#x591A;&#x5E74;&#x5185;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#x3002;</p>
<h3 id="&#x5982;&#x4F55;&#x8BF4;&#x670D;&#x4F60;&#x7684;&#x56E2;&#x961F;&#xFF1F;">&#x5982;&#x4F55;&#x8BF4;&#x670D;&#x4F60;&#x7684;&#x56E2;&#x961F;&#xFF1F;</h3>
<p><strong>&#x7F51;&#x7AD9;&#x4E0D;&#x5FC5;&#x5728;&#x6240;&#x6709;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x770B;&#x8D77;&#x6765;&#x90FD;&#x4E00;&#x6837;</strong></p>
<p>&#x6211;&#x76F8;&#x4FE1;&#x6700;&#x5927;&#x7684;&#x969C;&#x788D;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x5BF9;Grid&#x5E38;&#x89C1;&#x7684;&#x8BEF;&#x89E3;&#xFF0C;&#x8BA4;&#x4E3A;&#x5E7F;&#x6CDB;&#x91C7;&#x7528;Grid&#x5C31;&#x662F;&#x7F51;&#x7AD9;&#x5728;&#x6240;&#x6709;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x770B;&#x8D77;&#x6765;&#x90FD;&#x4E00;&#x6837;&#x3002; &#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x901A;&#x5E38;&#x9886;&#x5BFC;&#x8BA4;&#x4E3A;&#x5C31;&#x662F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6216;&#x8005;&#x65E0;&#x6CD5;&#x4E0E;&#x5BA2;&#x6237;&#x6C9F;&#x901A;&#x6E05;&#x695A;&#x3002; &#x6CA1;&#x6709;&#x4EBA;&#x5E0C;&#x671B;&#x4F60;&#x7684;&#x5BA2;&#x6237;&#x5728;&#x8FD0;&#x884C;IE9&#x7684;&#x53E4;&#x8001;&#x5431;&#x5431;&#x4F5C;&#x54CD;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x6253;&#x5F00;&#x4F60;&#x6F02;&#x4EAE;&#xFF0C;&#x95EA;&#x4EAE;&#x7684;&#x65B0;&#x7F51;&#x7AD9;&#xFF0C;&#x5E76;&#x7ACB;&#x523B;&#x5927;&#x5403;&#x4E00;&#x60CA;&#xFF0C;&#x5B83;&#x4E0D;&#x80FD;&#x8F9C;&#x8D1F;&#x8BBE;&#x8BA1;&#x3002;  </p>
<p>&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x9700;&#x8981;&#x5C06;&#x6848;&#x4F8B;&#x63D0;&#x524D;&#x8FDB;&#x884C;&#x6E10;&#x8FDB;&#x5F0F;&#x589E;&#x5F3A;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x5728;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x3002; &#x8BA9;&#x9886;&#x5BFC;&#x548C;&#x8BBE;&#x8BA1;&#x5E08;&#x4E86;&#x89E3;&#x65E7;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5C40;&#x9650;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x5B9E;&#x73B0;&#x8BBE;&#x8BA1;&#x5728;&#x6240;&#x6709;&#x6D4F;&#x89C8;&#x5668;&#x770B;&#x8D77;&#x6765;&#x76F8;&#x540C;&#x6240;&#x9700;&#x8981;&#x7684;&#x6210;&#x672C;&#x3002; &#x8FD9;&#x4E0D;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x6574;&#x4E2A;&#x7EC4;&#x7EC7;&#x7684;&#x7B56;&#x7565;&#x3002;  </p>
<p>&#x6211;&#x77E5;&#x9053;&#x6539;&#x53D8;&#x6574;&#x4E2A;&#x7EC4;&#x7EC7;&#x7684;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x542C;&#x8D77;&#x6765;&#x5F88;&#x96BE;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x5728;&#x4E00;&#x591C;&#x4E4B;&#x95F4;&#x53D1;&#x751F;&#x3002; &#x6211;&#x770B;&#x5230;&#x7684;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#x662F;&#x8BBE;&#x8BA1;&#x5E08;&#x5B9E;&#x9645;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x7B80;&#x5316;&#x7248;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x4F5C;&#x4E3A;&#x5B8C;&#x5168;&#x652F;&#x6301;&#x7248;&#x672C;&#x7684;&#x540E;&#x9000;&#x7248;&#x672C;&#x5448;&#x73B0;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x5C31;&#x50CF;&#x5B83;&#x4EEC;&#x5448;&#x73B0;&#x79FB;&#x52A8;&#x548C;&#x5E73;&#x677F;&#x7535;&#x8111;&#x7248;&#x672C;&#x7684;&#x8BBE;&#x8BA1;&#x4E00;&#x6837;&#x3002; &#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x610F;&#x8BC6;&#x5230;&#x67D0;&#x4E9B;&#x6D4F;&#x89C8;&#x5668;&#x5C06;&#x83B7;&#x5F97;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x5E03;&#x5C40;&#xFF0C;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5927;&#x60CA;&#x559C;&#x3002; &#x6B64;&#x5916;&#xFF0C;&#x8BBE;&#x8BA1;&#x5E08;&#x5B9E;&#x9645;&#x4E0A;&#x53EF;&#x4EE5;&#x4EE5;&#x4E00;&#x79CD;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x8BBE;&#x8BA1;&#x5B83;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F9D;&#x8D56;&#x4E8E;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x89E3;&#x91CA;&#x3002; &#x867D;&#x7136;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x4F1A;&#x6D89;&#x53CA;&#x66F4;&#x591A;&#x7684;&#x8BBE;&#x8BA1;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x5728;&#x5F00;&#x53D1;&#x65B9;&#x9762;&#x53EF;&#x4EE5;&#x8282;&#x7701;&#x5F88;&#x591A;&#x3002; &#x6211;&#x5E0C;&#x671B;&#x770B;&#x5230;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x666E;&#x904D;&#x3002;  </p>
<h3 id="&#x73B0;&#x5728;&#x8BD5;&#x8BD5;&#x5427;&#xFF01;">&#x73B0;&#x5728;&#x8BD5;&#x8BD5;&#x5427;&#xFF01;</h3>
<p>&#x4F60;&#x4E0D;&#x5FC5;&#x5168;&#x529B;&#x6295;&#x5165;Grid - &#x5B83;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x4E00;&#x79CD;&#x5168;&#x6709;&#x6216;&#x5168;&#x65E0;&#x7684;&#x65B9;&#x6CD5;&#x3002; &#x5F15;&#x5165;Grid&#x7684;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x4E4B;&#x4E00;&#x662F;&#x4ECE;&#x8F83;&#x5C0F;&#x7684;UI&#x6A21;&#x5757;&#x5F00;&#x59CB;&#x3002; &#x8FD9;&#x6837;&#x4F60;&#x5C31;&#x6709;&#x673A;&#x4F1A;&#x5728;&#x89C6;&#x89C9;&#x4E0A;&#x5C55;&#x793A;&#x5B83;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x5E76;&#x5E0C;&#x671B;&#x5B66;&#x597D;&#x5B83; - &#x6216;&#x8005;&#x81F3;&#x5C11;&#x6FC0;&#x8D77;&#x4F60;&#x56E2;&#x961F;&#x91CC;&#x5176;&#x4ED6;&#x6210;&#x5458;&#x7684;&#x597D;&#x5947;&#x5FC3;&#x3002; &#x901A;&#x8FC7;&#x5C55;&#x793A;&#x800C;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x8BF4;&#x51FA;&#x6765;&#x7684;&#x65B9;&#x5F0F;&#x901A;&#x5E38;&#x66F4;&#x597D;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x7F51;&#x683C;&#x4E0E;&#x73B0;&#x6709;&#x5E03;&#x5C40;&#x7CFB;&#x7EDF;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x59A5;&#xFF0C;&#x800C;&#x4E14;&#x4EBA;&#x4EEC;&#x5BF9;&#x6B64;&#x611F;&#x5230;&#x6EE1;&#x610F;&#x3002; &#x8FD9;&#x7ED9;&#x4E86;&#x4F60;&#x5B66;&#x4E60;&#x4E0B;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x65F6;&#x95F4;......</p>
<p><strong>&#x5236;&#x5B9A;&#x7B56;&#x7565;</strong></p>
<p>&#x6B63;&#x5982;&#x6211;&#x4E4B;&#x524D;&#x63D0;&#x5230;&#x7684;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Grid&#x6784;&#x5EFA;&#x5E03;&#x5C40;&#x3002; &#x4F60;&#x9700;&#x8981;&#x8003;&#x8651;&#x4F60;&#x548C;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x5C06;&#x5982;&#x4F55;&#x5B9E;&#x65BD;&#x5236;&#x5B9A;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x786E;&#x4FDD;&#x7EF4;&#x62A4;&#x4E0D;&#x4F1A;&#x6210;&#x4E3A;&#x95EE;&#x9898;&#x3002; &#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x8BA4;&#x4E3A;&#xFF0C;&#x4E00;&#x65E6;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x5B66;&#x4F1A;&#x4E86;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4ED6;&#x4EEC;&#x559C;&#x6B22;&#x7684;&#x4EFB;&#x4F55;&#x65B9;&#x6CD5;&#x6765;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x53EF;&#x80FD;&#x51B3;&#x5B9A;&#x4EC5;&#x4EC5;&#x4F7F;&#x7528;&#x884C;&#x53F7;&#x8FDB;&#x884C;&#x653E;&#x7F6E;&#x5E76;&#x907F;&#x514D;<code>grid-template-areas</code>&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x6DF7;&#x6DC6;&#x3002; &#x4F60;&#x53EF;&#x80FD;&#x51B3;&#x5B9A;&#x4E3A;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x5E03;&#x5C40;&#x9700;&#x6C42;&#x521B;&#x5EFA;&#x4E00;&#x4E9B;&#x5B9E;&#x7528;&#x7684;&#x7A0B;&#x5E8F;&#x7C7B;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x53EF;&#x80FD;&#x51B3;&#x5B9A;&#x5C06;&#x7F51;&#x683C;&#x4EE3;&#x7801;&#x4E0E;&#x7EC4;&#x4EF6;&#x7D27;&#x5BC6;&#x8026;&#x5408;&#x3002;   </p>
<p>&#x4F60;&#x8FD8;&#x9700;&#x8981;&#x8003;&#x8651;&#x6D4F;&#x89C8;&#x5668;&#x652F;&#x6301;&#x7B56;&#x7565;&#x3002; &#x4F60;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;<code>@supports</code>&#x5E76;&#x5C06;&#x6240;&#x6709;Grid&#x4EE3;&#x7801;&#x5305;&#x88C5;&#x5728;&#x5176;&#x4E2D;&#xFF0C;&#x8FD8;&#x662F;&#x4EC5;&#x9650;&#x4E8E;&#x4E25;&#x683C;&#x8981;&#x6C42;&#x7684;&#x5730;&#x65B9;&#xFF1F; &#x4F60;&#x505A;&#x4E2A;&#x7814;&#x7A76;&#x5E76;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x8BA1;&#x5212;&#x3002; &#x4F60;&#x7684;&#x7B56;&#x7565;&#x53EF;&#x80FD;&#x4F1A;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x800C;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x4F46;&#x4F60;&#x9700;&#x8981;&#x8BC1;&#x660E;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x8003;&#x8651;&#x8FC7;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E3A;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x63D0;&#x4F9B;&#x6700;&#x987A;&#x7545;&#x7684;&#x8FC7;&#x6E21;&#x7B56;&#x7565;&#x3002;  </p>
<p><strong>&#x63D0;&#x51FA;&#x65B9;&#x6848;</strong></p>
<p>&#x5C1D;&#x8BD5;&#x5E76;&#x6293;&#x4F4F;&#x673A;&#x4F1A;&#x5411;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x6216;&#x9886;&#x5BFC;&#x63D0;&#x4EA4;&#x4F60;&#x7684;&#x65B9;&#x6848;&#x3002; &#x5982;&#x679C;&#x4F60;&#x80FD;&#x8BA9;&#x522B;&#x4EBA;&#x89C9;&#x5F97;&#x4ED6;&#x4EEC;&#x4E5F;&#x662F;&#x8BA8;&#x8BBA;&#x65B9;&#x6848;&#x7684;&#x4E00;&#x4EFD;&#x5B50;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C31;&#x66F4;&#x6709;&#x53EF;&#x80FD;&#x52A0;&#x5165;&#x3002; &#x6B64;&#x5916;&#xFF0C;&#x53EF;&#x80FD;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x4F60;&#x6CA1;&#x6709;&#x60F3;&#x8FC7;&#x7684;&#x9677;&#x9631;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x6307;&#x51FA;&#xFF0C;&#x4F60;&#x4EEC;&#x53EF;&#x4EE5;&#x4E00;&#x8D77;&#x514B;&#x670D;&#x3002;  </p>
<p>&#x5728;&#x7EC4;&#x7EC7;&#x5185;&#x63A8;&#x52A8;&#x53D8;&#x9769;&#x901A;&#x5E38;&#x5F88;&#x96BE;&#x3002; &#x4F60;&#x6700;&#x597D;&#x7684;&#x9009;&#x62E9;&#x662F;&#x7A81;&#x51FA;&#x597D;&#x4E1C;&#x897F;&#xFF0C;&#x786E;&#x4FDD;&#x4F60;&#x8003;&#x8651;&#x4EFB;&#x4F55;&#x7F3A;&#x70B9;&#xFF0C;&#x8BD5;&#x7740;&#x62A2;&#x5148;&#x53D1;&#x73B0;&#x5E76;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002; &#x6700;&#x540E;&#xFF0C;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E9B;&#x76DF;&#x53CB;&#xFF01; &#x4E00;&#x8D77;&#x4FC3;&#x8FDB;&#x53D8;&#x9769;&#x4F1A;&#x5BB9;&#x6613;&#x5F97;&#x591A;&#xFF01;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../../" class="navigation navigation-prev " aria-label="Previous page: 杂物空间·翻译">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../color/ch.html" class="navigation navigation-next " aria-label="Next page: 颜色：从十六进制编码到眼球">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"如何说服你的团队采用CSS Grid","level":"1.2","depth":1,"next":{"title":"颜色：从十六进制编码到眼球","level":"1.3","depth":1,"path":"other/color/ch.md","ref":"other/color/ch.md","articles":[]},"previous":{"title":"杂物空间·翻译","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"other/how-to-convince-your-team-to-adopt-grid/ch.md","mtime":"2019-05-19T11:01:54.130Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-05-19T13:46:25.383Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

